# Aula 5: Pandas e Numpy

Pandas e NumPy são duas bibliotecas muito importantes para se trabalhar com dados no python.

A biblioteca NumPy que é bastante utilizada na academia para programação numérica

Já o Pandas é utilizado predominantemente para Data Visualization e para Data Analysis

In [1]:
import numpy as np

#### Vetorização

NumPy é excelente para operações com vetores.

Operações do tipo:

- multiplicação matricial e outras operações de álgebra linear  
- vetores de número aleatório  
- aplicação de transformação (ex., seno, cosseno, log, ...)

Vamos tentar criar duas matrizes utilizando listas. Uma 3 x 3 e outra um vetor 1 x 3:

In [2]:
a = [[ 5, 1 ,3], [ 1, 1 ,1], [ 1, 2 ,1]]
b = [1, 2, 3]
print(a)
print(b)
print(a*b)

[[5, 1, 3], [1, 1, 1], [1, 2, 1]]
[1, 2, 3]

TypeError: can't multiply sequence by non-int of type 'list'

Como podemos observar não conseguimos multiplicar essas duas listas. Analisando o erro fica claro que não podemos multiplicar uma lista por uma outra lista.

#### NumPy Arrays

A coisa mais importante que o NumPy define é um **array** N-dimensional formalmente denominado de [numpy.ndarray](http://docs.scipy.org/doc/numpy/reference/arrays.ndarray.html)

Podemos, então, recriar os vetores *a e b* como NumPy arrays e obter sua multiplicação da seguinte maneira:

In [3]:
a = np.array([[ 5, 1 ,3], [ 1, 1 ,1], [ 1, 2 ,1]])
b = np.array([1, 2, 3])
print(a*b)

[[5 2 9]
 [1 2 3]
 [1 4 3]]

In [4]:
type(a)

numpy.ndarray

Observe, porém, que a multiplicação foi realizada elemento por elemento.

Não obtivemos uma multiplicação matricial. Voltaremos a este problema mais tarde

NumPy arrays são parecidos com listas exceto que:

- As entradas devem ser *homogeneas* (elementos do mesmo tipo)  
- Esses tipos devem ser um dos tipos (`dtypes`) suportados pelo NumPy  


Os tipos mais importantes são:

- float64: 64 bit número em ponto flutuante  
- int64: 64 bit inteiro  
- bool:  8 bit True ou False  

Podemos obter o tipo de um objeto da seguinte maneira:

In [5]:
type(a), type(a[0][0])

(numpy.ndarray, numpy.int64)

In [6]:
a[0][0]

5

Para se obter a multiplicação matricial, devemod utilizar ".dot". Por exemplo:

In [7]:
print(a.dot(b))

[16  6  8]

Ainda assim nossa multiplicação não esta correta dado que estamos multiplicando uma matrix 3 x 3 por uma 1 x 3.

Redefinindo *b* da forma correta podemos obter a multiplicação matricial:

In [8]:
b = np.array([[1], [2], [3]])
print(b)
print("/n")
print(a.dot(b))

[[1]
 [2]
 [3]]
/n
[[16]
 [ 6]
 [ 8]]

Há uma outra maneira de se definir uma matriz. Essa envolve a utilização de [numpy.matrix](https://docs.scipy.org/doc/numpy/reference/generated/numpy.matrix.html)

Definindo-se dessa maneira as matrizes, podemos utilizar a operação produto (*), para multiplica-las:

In [9]:
sofi  = np.matrix([[5, 1 ,3], [1, 1 ,1], [1, 2 ,1]])

In [10]:
sofi.shape

(3, 3)

In [11]:
a

array([[5, 1, 3],
       [1, 1, 1],
       [1, 2, 1]])

In [12]:
a = np.matrix('[5, 1 ,3; 1, 1 ,1; 1, 2 ,1]')
b = np.matrix('[1; 2; 3]')
print(a)
a * b

[[5 1 3]
 [1 1 1]
 [1 2 1]]

matrix([[16],
        [ 6],
        [ 8]])

Podemos obter a transposta de diferentes maneiras:

In [13]:
a.transpose()

matrix([[5, 1, 1],
        [1, 1, 2],
        [3, 1, 1]])

In [14]:
a.T

matrix([[5, 1, 1],
        [1, 1, 2],
        [3, 1, 1]])

E a Inversa de uma matriz

In [15]:
a.getI()

matrix([[ 5.00000000e-01, -2.50000000e+00,  1.00000000e+00],
        [-3.08395285e-17, -1.00000000e+00,  1.00000000e+00],
        [-5.00000000e-01,  4.50000000e+00, -2.00000000e+00]])

In [16]:
a.I

matrix([[ 5.00000000e-01, -2.50000000e+00,  1.00000000e+00],
        [-3.08395285e-17, -1.00000000e+00,  1.00000000e+00],
        [-5.00000000e-01,  4.50000000e+00, -2.00000000e+00]])

No mais, NumPy arrays podem ser criados a partir de listas utilizando np.array

In [17]:
lista = [10, 20]
np.array(lista)

array([10, 20])

In [18]:
a

matrix([[5, 1, 3],
        [1, 1, 1],
        [1, 2, 1]])

In [19]:
a.mean()

1.7777777777777777

In [20]:
l = np.array(lista)

In [21]:
l.mean()

15.0

##### Métodos em um Array

In [22]:
a = np.array([5, 4, 3, 2, 1])
a

array([5, 4, 3, 2, 1])

In [23]:
a.sort()
a

array([1, 2, 3, 4, 5])

In [24]:
a.sum()

15

In [25]:
a.mean()

3.0

In [26]:
np.median(a)

3.0

In [27]:
a.max()

5

### PANDAS

Pandas será, provavelmente, a biblioteca mais utilizada por nós daqui em diante. Realizaremos quase todas as operações com dados nela. Importar, maniputar, salvar, estimar, ...

In [28]:
import pandas as pd

In [29]:
pd.read_csv("filmes.csv")

,Dunkirk (2017) - IMDb,713K,7.8,2023-09-25 15:45
0,Pirates of the Caribbean: Dead Men Tell No Tal...,333K,6.5,2023-09-25 15:45
1,Soul Surfer (2011) - IMDb,52K,7.0,2023-09-25 15:45
2,Top Gun (1986) - IMDb,485K,6.9,2023-09-25 15:45
3,Schindler's List (1993) - IMDb,1.4M,9.0,2023-09-25 15:45
4,403 Forbidden,-,-,2023-09-25 15:49
5,403 Forbidden,-,-,2023-09-25 15:49
6,403 Forbidden,-,-,2023-09-25 15:49
7,403 Forbidden,-,-,2023-09-25 15:49
8,403 Forbidden,-,-,2023-09-25 15:49
9,Dunkirk (2017) - IMDb,713K,7.8,2023-09-25 15:50
10,Pirates of the Caribbean: Dead Men Tell No Tal...,333K,6.5,2023-09-25 15:50
11,Soul Surfer (2011) - IMDb,52K,7.0,2023-09-25 15:50
12,Top Gun (1986) - IMDb,485K,6.9,2023-09-25 15:50
13,Schindler's List (1993) - IMDb,1.4M,9.0,2023-09-25 15:50

Podemos ler um arquivo em formato CSV, por exemplo, e transforma-lo em uma base (dataframe).

In [30]:
df1 = pd.read_csv("filmes.csv", header = None, names=['nome', 'obs', 'rate', 'data'])

In [31]:
df_gustavo = pd.read_csv("filmes.csv", header = None, names=['nome', 'obs', 'rate', 'data'])

In [32]:
df1

,nome,obs,rate,data
0,Dunkirk (2017) - IMDb,713K,7.8,2023-09-25 15:45
1,Pirates of the Caribbean: Dead Men Tell No Tal...,333K,6.5,2023-09-25 15:45
2,Soul Surfer (2011) - IMDb,52K,7.0,2023-09-25 15:45
3,Top Gun (1986) - IMDb,485K,6.9,2023-09-25 15:45
4,Schindler's List (1993) - IMDb,1.4M,9.0,2023-09-25 15:45
5,403 Forbidden,-,-,2023-09-25 15:49
6,403 Forbidden,-,-,2023-09-25 15:49
7,403 Forbidden,-,-,2023-09-25 15:49
8,403 Forbidden,-,-,2023-09-25 15:49
9,403 Forbidden,-,-,2023-09-25 15:49
10,Dunkirk (2017) - IMDb,713K,7.8,2023-09-25 15:50
11,Pirates of the Caribbean: Dead Men Tell No Tal...,333K,6.5,2023-09-25 15:50
12,Soul Surfer (2011) - IMDb,52K,7.0,2023-09-25 15:50
13,Top Gun (1986) - IMDb,485K,6.9,2023-09-25 15:50
14,Schindler's List (1993) - IMDb,1.4M,9.0,2023-09-25 15:50

In [33]:
df_gustavo

,nome,obs,rate,data
0,Dunkirk (2017) - IMDb,713K,7.8,2023-09-25 15:45
1,Pirates of the Caribbean: Dead Men Tell No Tal...,333K,6.5,2023-09-25 15:45
2,Soul Surfer (2011) - IMDb,52K,7.0,2023-09-25 15:45
3,Top Gun (1986) - IMDb,485K,6.9,2023-09-25 15:45
4,Schindler's List (1993) - IMDb,1.4M,9.0,2023-09-25 15:45
5,403 Forbidden,-,-,2023-09-25 15:49
6,403 Forbidden,-,-,2023-09-25 15:49
7,403 Forbidden,-,-,2023-09-25 15:49
8,403 Forbidden,-,-,2023-09-25 15:49
9,403 Forbidden,-,-,2023-09-25 15:49
10,Dunkirk (2017) - IMDb,713K,7.8,2023-09-25 15:50
11,Pirates of the Caribbean: Dead Men Tell No Tal...,333K,6.5,2023-09-25 15:50
12,Soul Surfer (2011) - IMDb,52K,7.0,2023-09-25 15:50
13,Top Gun (1986) - IMDb,485K,6.9,2023-09-25 15:50
14,Schindler's List (1993) - IMDb,1.4M,9.0,2023-09-25 15:50

In [34]:
df1.to_csv('filmes_YARA.csv')

In [35]:
df1

                                                nome   obs  rate        data
0                              Dunkirk (2017) - IMDb  648K   7.8  2022-09-19
1  Piratas do Caribe: A Vinganca de Salazar (2017...  309K   6.5  2022-09-19
2        Soul Surfer: Coragem de Viver (2011) - IMDb   50K   7.0  2022-09-19
3             Top Gun: Ases Indomaveis (1986) - IMDb  423K   6.9  2022-09-19
4                 A Lista de Schindler (1993) - IMDb  1.3M   9.0  2022-09-19
5                              Dunkirk (2017) - IMDb  648K   7.8         NaN
6  Piratas do Caribe: A Vinganca de Salazar (2017...  309K   6.5         NaN
7        Soul Surfer: Coragem de Viver (2011) - IMDb   50K   7.0         NaN
8             Top Gun: Ases Indomaveis (1986) - IMDb  423K   6.9         NaN
9                 A Lista de Schindler (1993) - IMDb  1.3M   9.0         NaN

In [36]:
yara = pd.read_csv("filmes_YARA.csv")

In [37]:
yara

,Unnamed: 0,nome,obs,rate,data
0,0,Dunkirk (2017) - IMDb,648K,7.8,2022-09-19
1,1,Piratas do Caribe: A Vinganca de Salazar (2017...,309K,6.5,2022-09-19
2,2,Soul Surfer: Coragem de Viver (2011) - IMDb,50K,7.0,2022-09-19
3,3,Top Gun: Ases Indomaveis (1986) - IMDb,423K,6.9,2022-09-19
4,4,A Lista de Schindler (1993) - IMDb,1.3M,9.0,2022-09-19
5,5,Dunkirk (2017) - IMDb,648K,7.8,NaN
6,6,Piratas do Caribe: A Vinganca de Salazar (2017...,309K,6.5,NaN
7,7,Soul Surfer: Coragem de Viver (2011) - IMDb,50K,7.0,NaN
8,8,Top Gun: Ases Indomaveis (1986) - IMDb,423K,6.9,NaN
9,9,A Lista de Schindler (1993) - IMDb,1.3M,9.0,NaN

Salvar uma base de dados em csv.

In [29]:
df1.to_csv('ex_save_filmes.csv', index=False)

In [40]:
df1

                                                 nome        obs  rate
0                               Dunkirk (2017) - IMDb    543.268   7.9
1   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
2         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
3              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
4                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
5                               Dunkirk (2017) - IMDb    543.268   7.9
6   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
7         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
8              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
9                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
10                   A Lista de Gustavo (2020) - IMDb  1.198.580   8.9

In [32]:
df1.to_pickle('dados.pkl')

In [33]:
filmes = pd.read_pickle("dados.pkl")

In [34]:
filmes

                                                 nome        obs  rate
0                               Dunkirk (2017) - IMDb    543.268   7.9
1   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
2         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
3              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
4                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
5                               Dunkirk (2017) - IMDb    543.268   7.9
6   Piratas do Caribe: A Vinganca de Salazar (2017...    259.112   6.6
7         Soul Surfer: Coragem de Viver (2011) - IMDb     45.257   7.0
8              Top Gun: Ases Indomaveis (1986) - IMDb    291.570   6.9
9                  A Lista de Schindler (1993) - IMDb  1.198.580   8.9
10                   A Lista de Gustavo (2020) - IMDb  1.198.580   8.9

O mesmo pode-se aplicar para o [pickle](). Podemos ler e salvar bases de dados em pickle

In [39]:
dfp = pd.read_pickle("dados_placas.pkl")

In [37]:
dfp

['KFD0001',
 'KFD0002',
 'KFD0003',
 'KFD0004',
 'KFD0005',
 'KFD0006',
 'KFD0007',
 'KFD0008',
 'KFD0009',
 'KFD0010',
 'KFD0011',
 'KFD0012',
 'KFD0013',
 'KFD0014',
 'KFD0015',
 'KFD0016',
 'KFD0017',
 'KFD0018',
 'KFD0019',
 'KFD0020',
 'KFD0021',
 'KFD0022',
 'KFD0023',
 'KFD0024',
 'KFD0025',
 'KFD0026',
 'KFD0027',
 'KFD0028',
 'KFD0029',
 'KFD0030',
 'KFD0031',
 'KFD0032',
 'KFD0033',
 'KFD0034',
 'KFD0035',
 'KFD0036',
 'KFD0037',
 'KFD0038',
 'KFD0039',
 'KFD0040',
 'KFD0041',
 'KFD0042',
 'KFD0043',
 'KFD0044',
 'KFD0045',
 'KFD0046',
 'KFD0047',
 'KFD0048',
 'KFD0049',
 'KFD0050',
 'KFD0051',
 'KFD0052',
 'KFD0053',
 'KFD0054',
 'KFD0055',
 'KFD0056',
 'KFD0057',
 'KFD0058',
 'KFD0059',
 'KFD0060',
 'KFD0061',
 'KFD0062',
 'KFD0063',
 'KFD0064',
 'KFD0065',
 'KFD0066',
 'KFD0067',
 'KFD0068',
 'KFD0069',
 'KFD0070',
 'KFD0071',
 'KFD0072',
 'KFD0073',
 'KFD0074',
 'KFD0075',
 'KFD0076',
 'KFD0077',
 'KFD0078',
 'KFD0079',
 'KFD0080',
 'KFD0081',
 'KFD0082',
 'KFD0083',
 'KFD0084',
 'KFD0085',
 'KFD0086',
 'KFD0087',
 'KFD0088',
 'KFD0089',
 'KFD0090',
 'KFD0091',
 'KFD0092',
 'KFD0093',
 'KFD0094',
 'KFD0095',
 'KFD0096',
 'KFD0097',
 'KFD0098',
 'KFD0099',
 'KFD0100',
 'KFD0101',
 'KFD0102',
 'KFD0103',
 'KFD0104',
 'KFD0105',
 'KFD0106',
 'KFD0107',
 'KFD0108',
 'KFD0109',
 'KFD0110',
 'KFD0111',
 'KFD0112',
 'KFD0113',
 'KFD0114',
 'KFD0115',
 'KFD0116',
 'KFD0117',
 'KFD0118',
 'KFD0119',
 'KFD0120',
 'KFD0121',
 'KFD0122',
 'KFD0123',
 'KFD0124',
 'KFD0125',
 'KFD0126',
 'KFD0127',
 'KFD0128',
 'KFD0129',
 'KFD0130',
 'KFD0131',
 'KFD0132',
 'KFD0133',
 'KFD0134',
 'KFD0135',
 'KFD0136',
 'KFD0137',
 'KFD0138',
 'KFD0139',
 'KFD0140',
 'KFD0141',
 'KFD0142',
 'KFD0143',
 'KFD0144',
 'KFD0145',
 'KFD0146',
 'KFD0147',
 'KFD0148',
 'KFD0149',
 'KFD0150',
 'KFD0151',
 'KFD0152',
 'KFD0153',
 'KFD0154',
 'KFD0155',
 'KFD0156',
 'KFD0157',
 'KFD0158',
 'KFD0159',
 'KFD0160',
 'KFD0161',
 'KFD0162',
 'KFD0163',
 'KFD0164',
 'KFD0165',
 'KFD0166',
 'KFD0167',
 'KFD0168',
 'KFD0169',
 'KFD0170',
 'KFD0171',
 'KFD0172',
 'KFD0173',
 'KFD0174',
 'KFD0175',
 'KFD0176',
 'KFD0177',
 'KFD0178',
 'KFD0179',
 'KFD0180',
 'KFD0181',
 'KFD0182',
 'KFD0183',
 'KFD0184',
 'KFD0185',
 'KFD0186',
 'KFD0187',
 'KFD0188',
 'KFD0189',
 'KFD0190',
 'KFD0191',
 'KFD0192',
 'KFD0193',
 'KFD0194',
 'KFD0195',
 'KFD0196',
 'KFD0197',
 'KFD0198',
 'KFD0199',
 'KFD0200',
 'KFD0201',
 'KFD0202',
 'KFD0203',
 'KFD0204',
 'KFD0205',
 'KFD0206',
 'KFD0207',
 'KFD0208',
 'KFD0209',
 'KFD0210',
 'KFD0211',
 'KFD0212',
 'KFD0213',
 'KFD0214',
 'KFD0215',
 'KFD0216',
 'KFD0217',
 'KFD0218',
 'KFD0219',
 'KFD0220',
 'KFD0221',
 'KFD0222',
 'KFD0223',
 'KFD0224',
 'KFD0225',
 'KFD0226',
 'KFD0227',
 'KFD0228',
 'KFD0229',
 'KFD0230',
 'KFD0231',
 'KFD0232',
 'KFD0233',
 'KFD0234',
 'KFD0235',
 'KFD0236',
 'KFD0237',
 'KFD0238',
 'KFD0239',
 'KFD0240',
 'KFD0241',
 'KFD0242',
 'KFD0243',
 'KFD0244',
 'KFD0245',
 'KFD0246',
 'KFD0247',
 'KFD0248',
 'KFD0249',
 'KFD0250',
 'KFD0251',
 'KFD0252',
 'KFD0253',
 'KFD0254',
 'KFD0255',
 'KFD0256',
 'KFD0257',
 'KFD0258',
 'KFD0259',
 'KFD0260',
 'KFD0261',
 'KFD0262',
 'KFD0263',
 'KFD0264',
 'KFD0265',
 'KFD0266',
 'KFD0267',
 'KFD0268',
 'KFD0269',
 'KFD0270',
 'KFD0271',
 'KFD0272',
 'KFD0273',
 'KFD0274',
 'KFD0275',
 'KFD0276',
 'KFD0277',
 'KFD0278',
 'KFD0279',
 'KFD0280',
 'KFD0281',
 'KFD0282',
 'KFD0283',
 'KFD0284',
 'KFD0285',
 'KFD0286',
 'KFD0287',
 'KFD0288',
 'KFD0289',
 'KFD0290',
 'KFD0291',
 'KFD0292',
 'KFD0293',
 'KFD0294',
 'KFD0295',
 'KFD0296',
 'KFD0297',
 'KFD0298',
 'KFD0299',
 'KFD0300',
 'KFD0301',
 'KFD0302',
 'KFD0303',
 'KFD0304',
 'KFD0305',
 'KFD0306',
 'KFD0307',
 'KFD0308',
 'KFD0309',
 'KFD0310',
 'KFD0311',
 'KFD0312',
 'KFD0313',
 'KFD0314',
 'KFD0315',
 'KFD0316',
 'KFD0317',
 'KFD0318',
 'KFD0319',
 'KFD0320',
 'KFD0321',
 'KFD0322',
 'KFD0323',
 'KFD0324',
 'KFD0325',
 'KFD0326',
 'KFD0327',
 'KFD0328',
 'KFD0329',
 'KFD0330',
 'KFD0331',
 'KFD0332',
 'KFD0333',
 'KFD0334',
 'KFD0335',
 'KFD0336',
 'KFD0337',
 'KFD0338',
 'KFD0339',
 'KFD0340',
 'KFD0341',
 'KFD0342',
 'KFD0343',
 'KFD0344',
 'KFD0345',
 'KFD0346',
 'KFD0347',
 'KFD0348',
 'KFD0349',
 'KFD0350',
 'KFD0351',
 'KFD0352',
 'KFD0353',
 'KFD0354',
 'KFD0355',
 'KFD0356',
 'KFD0357',
 'KFD0358',
 'KFD0359',
 'KFD0360',
 'KFD0361',
 'KFD0362',
 'KFD0363',
 'KFD0364',
 'KFD0365',
 'KFD0366',
 'KFD0367',
 'KFD0368',
 'KFD0369',
 'KFD0370',
 'KFD0371',
 'KFD0372',
 'KFD0373',
 'KFD0374',
 'KFD0375',
 'KFD0376',
 'KFD0377',
 'KFD0378',
 'KFD0379',
 'KFD0380',
 'KFD0381',
 'KFD0382',
 'KFD0383',
 'KFD0384',
 'KFD0385',
 'KFD0386',
 'KFD0387',
 'KFD0388',
 'KFD0389',
 'KFD0390',
 'KFD0391',
 'KFD0392',
 'KFD0393',
 'KFD0394',
 'KFD0395',
 'KFD0396',
 'KFD0397',
 'KFD0398',
 'KFD0399',
 'KFD0400',
 'KFD0401',
 'KFD0402',
 'KFD0403',
 'KFD0404',
 'KFD0405',
 'KFD0406',
 'KFD0407',
 'KFD0408',
 'KFD0409',
 'KFD0410',
 'KFD0411',
 'KFD0412',
 'KFD0413',
 'KFD0414',
 'KFD0415',
 'KFD0416',
 'KFD0417',
 'KFD0418',
 'KFD0419',
 'KFD0420',
 'KFD0421',
 'KFD0422',
 'KFD0423',
 'KFD0424',
 'KFD0425',
 'KFD0426',
 'KFD0427',
 'KFD0428',
 'KFD0429',
 'KFD0430',
 'KFD0431',
 'KFD0432',
 'KFD0433',
 'KFD0434',
 'KFD0435',
 'KFD0436',
 'KFD0437',
 'KFD0438',
 'KFD0439',
 'KFD0440',
 'KFD0441',
 'KFD0442',
 'KFD0443',
 'KFD0444',
 'KFD0445',
 'KFD0446',
 'KFD0447',
 'KFD0448',
 'KFD0449',
 'KFD0450',
 'KFD0451',
 'KFD0452',
 'KFD0453',
 'KFD0454',
 'KFD0455',
 'KFD0456',
 'KFD0457',
 'KFD0458',
 'KFD0459',
 'KFD0460',
 'KFD0461',
 'KFD0462',
 'KFD0463',
 'KFD0464',
 'KFD0465',
 'KFD0466',
 'KFD0467',
 'KFD0468',
 'KFD0469',
 'KFD0470',
 'KFD0471',
 'KFD0472',
 'KFD0473',
 'KFD0474',
 'KFD0475',
 'KFD0476',
 'KFD0477',
 'KFD0478',
 'KFD0479',
 'KFD0480',
 'KFD0481',
 'KFD0482',
 'KFD0483',
 'KFD0484',
 'KFD0485',
 'KFD0486',
 'KFD0487',
 'KFD0488',
 'KFD0489',
 'KFD0490',
 'KFD0491',
 'KFD0492',
 'KFD0493',
 'KFD0494',
 'KFD0495',
 'KFD0496',
 'KFD0497',
 'KFD0498',
 'KFD0499',
 'KFD0500',
 'KFD0501',
 'KFD0502',
 'KFD0503',
 'KFD0504',
 'KFD0505',
 'KFD0506',
 'KFD0507',
 'KFD0508',
 'KFD0509',
 'KFD0510',
 'KFD0511',
 'KFD0512',
 'KFD0513',
 'KFD0514',
 'KFD0515',
 'KFD0516',
 'KFD0517',
 'KFD0518',
 'KFD0519',
 'KFD0520',
 'KFD0521',
 'KFD0522',
 'KFD0523',
 'KFD0524',
 'KFD0525',
 'KFD0526',
 'KFD0527',
 'KFD0528',
 'KFD0529',
 'KFD0530',
 'KFD0531',
 'KFD0532',
 'KFD0533',
 'KFD0534',
 'KFD0535',
 'KFD0536',
 'KFD0537',
 'KFD0538',
 'KFD0539',
 'KFD0540',
 'KFD0541',
 'KFD0542',
 'KFD0543',
 'KFD0544',
 'KFD0545',
 'KFD0546',
 'KFD0547',
 'KFD0548',
 'KFD0549',
 'KFD0550',
 'KFD0551',
 'KFD0552',
 'KFD0553',
 'KFD0554',
 'KFD0555',
 'KFD0556',
 'KFD0557',
 'KFD0558',
 'KFD0559',
 'KFD0560',
 'KFD0561',
 'KFD0562',
 'KFD0563',
 'KFD0564',
 'KFD0565',
 'KFD0566',
 'KFD0567',
 'KFD0568',
 'KFD0569',
 'KFD0570',
 'KFD0571',
 'KFD0572',
 'KFD0573',
 'KFD0574',
 'KFD0575',
 'KFD0576',
 'KFD0577',
 'KFD0578',
 'KFD0579',
 'KFD0580',
 'KFD0581',
 'KFD0582',
 'KFD0583',
 'KFD0584',
 'KFD0585',
 'KFD0586',
 'KFD0587',
 'KFD0588',
 'KFD0589',
 'KFD0590',
 'KFD0591',
 'KFD0592',
 'KFD0593',
 'KFD0594',
 'KFD0595',
 'KFD0596',
 'KFD0597',
 'KFD0598',
 'KFD0599',
 'KFD0600',
 'KFD0601',
 'KFD0602',
 'KFD0603',
 'KFD0604',
 'KFD0605',
 'KFD0606',
 'KFD0607',
 'KFD0608',
 'KFD0609',
 'KFD0610',
 'KFD0611',
 'KFD0612',
 'KFD0613',
 'KFD0614',
 'KFD0615',
 'KFD0616',
 'KFD0617',
 'KFD0618',
 'KFD0619',
 'KFD0620',
 'KFD0621',
 'KFD0622',
 'KFD0623',
 'KFD0624',
 'KFD0625',
 'KFD0626',
 'KFD0627',
 'KFD0628',
 'KFD0629',
 'KFD0630',
 'KFD0631',
 'KFD0632',
 'KFD0633',
 'KFD0634',
 'KFD0635',
 'KFD0636',
 'KFD0637',
 'KFD0638',
 'KFD0639',
 'KFD0640',
 'KFD0641',
 'KFD0642',
 'KFD0643',
 'KFD0644',
 'KFD0645',
 'KFD0646',
 'KFD0647',
 'KFD0648',
 'KFD0649',
 'KFD0650',
 'KFD0651',
 'KFD0652',
 'KFD0653',
 'KFD0654',
 'KFD0655',
 'KFD0656',
 'KFD0657',
 'KFD0658',
 'KFD0659',
 'KFD0660',
 'KFD0661',
 'KFD0662',
 'KFD0663',
 'KFD0664',
 'KFD0665',
 'KFD0666',
 'KFD0667',
 'KFD0668',
 'KFD0669',
 'KFD0670',
 'KFD0671',
 'KFD0672',
 'KFD0673',
 'KFD0674',
 'KFD0675',
 'KFD0676',
 'KFD0677',
 'KFD0678',
 'KFD0679',
 'KFD0680',
 'KFD0681',
 'KFD0682',
 'KFD0683',
 'KFD0684',
 'KFD0685',
 'KFD0686',
 'KFD0687',
 'KFD0688',
 'KFD0689',
 'KFD0690',
 'KFD0691',
 'KFD0692',
 'KFD0693',
 'KFD0694',
 'KFD0695',
 'KFD0696',
 'KFD0697',
 'KFD0698',
 'KFD0699',
 'KFD0700',
 'KFD0701',
 'KFD0702',
 'KFD0703',
 'KFD0704',
 'KFD0705',
 'KFD0706',
 'KFD0707',
 'KFD0708',
 'KFD0709',
 'KFD0710',
 'KFD0711',
 'KFD0712',
 'KFD0713',
 'KFD0714',
 'KFD0715',
 'KFD0716',
 'KFD0717',
 'KFD0718',
 'KFD0719',
 'KFD0720',
 'KFD0721',
 'KFD0722',
 'KFD0723',
 'KFD0724',
 'KFD0725',
 'KFD0726',
 'KFD0727',
 'KFD0728',
 'KFD0729',
 'KFD0730',
 'KFD0731',
 'KFD0732',
 'KFD0733',
 'KFD0734',
 'KFD0735',
 'KFD0736',
 'KFD0737',
 'KFD0738',
 'KFD0739',
 'KFD0740',
 'KFD0741',
 'KFD0742',
 'KFD0743',
 'KFD0744',
 'KFD0745',
 'KFD0746',
 'KFD0747',
 'KFD0748',
 'KFD0749',
 'KFD0750',
 'KFD0751',
 'KFD0752',
 'KFD0753',
 'KFD0754',
 'KFD0755',
 'KFD0756',
 'KFD0757',
 'KFD0758',
 'KFD0759',
 'KFD0760',
 'KFD0761',
 'KFD0762',
 'KFD0763',
 'KFD0764',
 'KFD0765',
 'KFD0766',
 'KFD0767',
 'KFD0768',
 'KFD0769',
 'KFD0770',
 'KFD0771',
 'KFD0772',
 'KFD0773',
 'KFD0774',
 'KFD0775',
 'KFD0776',
 'KFD0777',
 'KFD0778',
 'KFD0779',
 'KFD0780',
 'KFD0781',
 'KFD0782',
 'KFD0783',
 'KFD0784',
 'KFD0785',
 'KFD0786',
 'KFD0787',
 'KFD0788',
 'KFD0789',
 'KFD0790',
 'KFD0791',
 'KFD0792',
 'KFD0793',
 'KFD0794',
 'KFD0795',
 'KFD0796',
 'KFD0797',
 'KFD0798',
 'KFD0799',
 'KFD0800',
 'KFD0801',
 'KFD0802',
 'KFD0803',
 'KFD0804',
 'KFD0805',
 'KFD0806',
 'KFD0807',
 'KFD0808',
 'KFD0809',
 'KFD0810',
 'KFD0811',
 'KFD0812',
 'KFD0813',
 'KFD0814',
 'KFD0815',
 'KFD0816',
 'KFD0817',
 'KFD0818',
 'KFD0819',
 'KFD0820',
 'KFD0821',
 'KFD0822',
 'KFD0823',
 'KFD0824',
 'KFD0825',
 'KFD0826',
 'KFD0827',
 'KFD0828',
 'KFD0829',
 'KFD0830',
 'KFD0831',
 'KFD0832',
 'KFD0833',
 'KFD0834',
 'KFD0835',
 'KFD0836',
 'KFD0837',
 'KFD0838',
 'KFD0839',
 'KFD0840',
 'KFD0841',
 'KFD0842',
 'KFD0843',
 'KFD0844',
 'KFD0845',
 'KFD0846',
 'KFD0847',
 'KFD0848',
 'KFD0849',
 'KFD0850',
 'KFD0851',
 'KFD0852',
 'KFD0853',
 'KFD0854',
 'KFD0855',
 'KFD0856',
 'KFD0857',
 'KFD0858',
 'KFD0859',
 'KFD0860',
 'KFD0861',
 'KFD0862',
 'KFD0863',
 'KFD0864',
 'KFD0865',
 'KFD0866',
 'KFD0867',
 'KFD0868',
 'KFD0869',
 'KFD0870',
 'KFD0871',
 'KFD0872',
 'KFD0873',
 'KFD0874',
 'KFD0875',
 'KFD0876',
 'KFD0877',
 'KFD0878',
 'KFD0879',
 'KFD0880',
 'KFD0881',
 'KFD0882',
 'KFD0883',
 'KFD0884',
 'KFD0885',
 'KFD0886',
 'KFD0887',
 'KFD0888',
 'KFD0889',
 'KFD0890',
 'KFD0891',
 'KFD0892',
 'KFD0893',
 'KFD0894',
 'KFD0895',
 'KFD0896',
 'KFD0897',
 'KFD0898',
 'KFD0899',
 'KFD0900',
 'KFD0901',
 'KFD0902',
 'KFD0903',
 'KFD0904',
 'KFD0905',
 'KFD0906',
 'KFD0907',
 'KFD0908',
 'KFD0909',
 'KFD0910',
 'KFD0911',
 'KFD0912',
 'KFD0913',
 'KFD0914',
 'KFD0915',
 'KFD0916',
 'KFD0917',
 'KFD0918',
 'KFD0919',
 'KFD0920',
 'KFD0921',
 'KFD0922',
 'KFD0923',
 'KFD0924',
 'KFD0925',
 'KFD0926',
 'KFD0927',
 'KFD0928',
 'KFD0929',
 'KFD0930',
 'KFD0931',
 'KFD0932',
 'KFD0933',
 'KFD0934',
 'KFD0935',
 'KFD0936',
 'KFD0937',
 'KFD0938',
 'KFD0939',
 'KFD0940',
 'KFD0941',
 'KFD0942',
 'KFD0943',
 'KFD0944',
 'KFD0945',
 'KFD0946',
 'KFD0947',
 'KFD0948',
 'KFD0949',
 'KFD0950',
 'KFD0951',
 'KFD0952',
 'KFD0953',
 'KFD0954',
 'KFD0955',
 'KFD0956',
 'KFD0957',
 'KFD0958',
 'KFD0959',
 'KFD0960',
 'KFD0961',
 'KFD0962',
 'KFD0963',
 'KFD0964',
 'KFD0965',
 'KFD0966',
 'KFD0967',
 'KFD0968',
 'KFD0969',
 'KFD0970',
 'KFD0971',
 'KFD0972',
 'KFD0973',
 'KFD0974',
 'KFD0975',
 'KFD0976',
 'KFD0977',
 'KFD0978',
 'KFD0979',
 'KFD0980',
 'KFD0981',
 'KFD0982',
 'KFD0983',
 'KFD0984',
 'KFD0985',
 'KFD0986',
 'KFD0987',
 'KFD0988',
 'KFD0989',
 'KFD0990',
 'KFD0991',
 'KFD0992',
 'KFD0993',
 'KFD0994',
 'KFD0995',
 'KFD0996',
 'KFD0997',
 'KFD0998',
 'KFD0999',
 'KFD1000',
 ...]

In [40]:
dfp_paulo = pd.DataFrame(dfp)

In [43]:
dfp_paulo

               0
0        KFD0001
1        KFD0002
2        KFD0003
3        KFD0004
4        KFD0005
...          ...
3319663  PGZ9995
3319664  PGZ9996
3319665  PGZ9997
3319666  PGZ9998
3319667  PGZ9999

[3319668 rows x 1 columns]

In [34]:
pd.DataFrame([27,43,12,34,56])

    0
0  27
1  43
2  12
3  34
4  56

In [35]:
pd.DataFrame([{"nome":"Luiza", "idade":23},{"nome":"Jessycka", "idade":21}])

       nome  idade
0     Luiza     23
1  Jessycka     21

In [36]:
import numpy as np

In [43]:
np.random.seed(348)

In [38]:
np.random.randn(10, 5)

array([[-0.74514763, -1.46266894,  1.54404756, -0.31482662,  1.36373213],
       [ 0.32085106,  1.29412995,  0.0143156 ,  0.14287208, -0.41008282],
       [-1.12083216, -0.55690501,  1.63577838, -1.03892929, -0.29886137],
       [-0.39862243, -0.33556923, -1.24802003, -0.67311139,  0.60756303],
       [ 0.86236012, -1.7406042 ,  0.29265206, -0.66594992,  0.64543729],
       [-1.26187917,  0.78069167,  0.86589102, -0.73428542, -0.93107143],
       [ 0.89830949,  0.43982177,  1.51167026,  1.47126806, -0.41588905],
       [-0.5301987 , -1.49244846,  0.97906741, -0.27851437, -0.50744542],
       [-0.36497737, -0.6466633 ,  0.36642132,  0.69406482,  1.81706187],
       [-0.41561977,  1.02982406,  0.54369807, -1.03696244, -0.09391205]])

In [23]:
dfp.to_pickle("dados1.pkl")

Ou gerar uma base de dados com números aleatórios

In [40]:
df2 = pd.DataFrame(np.random.randn(10, 5))

In [35]:
#seed = 37987384

In [41]:
df2

          0         1         2         3         4
0 -0.745148 -1.462669  1.544048 -0.314827  1.363732
1  0.320851  1.294130  0.014316  0.142872 -0.410083
2 -1.120832 -0.556905  1.635778 -1.038929 -0.298861
3 -0.398622 -0.335569 -1.248020 -0.673111  0.607563
4  0.862360 -1.740604  0.292652 -0.665950  0.645437
5 -1.261879  0.780692  0.865891 -0.734285 -0.931071
6  0.898309  0.439822  1.511670  1.471268 -0.415889
7 -0.530199 -1.492448  0.979067 -0.278514 -0.507445
8 -0.364977 -0.646663  0.366421  0.694065  1.817062
9 -0.415620  1.029824  0.543698 -1.036962 -0.093912

Array 10-por-5 de amostras de uma N(0, 1):

In [42]:
np.random.randn(10, 5)

array([[ 2.52167367,  1.61975886, -0.82022577, -0.48772754, -0.09869889],
       [-1.83654245,  0.55535121, -0.88008513,  0.77704237,  1.75933062],
       [-0.75727009,  0.25917791,  0.50515296, -0.42478323,  0.15291093],
       [ 0.47856111,  0.71549107,  0.83473425, -0.48329803, -0.31592175],
       [-0.94085722,  0.04387738,  0.9080636 ,  0.81681172, -1.60632205],
       [ 0.26751739,  2.27733156, -0.57088182, -0.74022969,  0.83072685],
       [-0.5958215 ,  0.58772034,  0.10628872, -0.5407303 , -0.62582666],
       [-0.38944248,  0.02037429,  0.23342369, -1.71760353, -0.29137084],
       [-0.84085245,  1.11505627,  0.72228551, -0.28326351,  0.16359511],
       [ 1.13915731, -1.18333203, -1.51778934, -0.65531438,  1.00987297]])

In [29]:
an = np.random.randn(10, 5)

In [30]:
pd.DataFrame(an)

          0         1         2         3         4
0 -0.415811  0.634043 -0.320084 -1.035141 -1.472318
1 -0.542063 -0.176143 -1.338999  1.164823  1.651221
2  0.204946  0.519608 -0.064065 -1.443523 -0.982411
3 -1.420311  0.993670  0.564678  0.244036 -1.161996
4  0.623735 -1.096172 -0.290833 -0.643554 -0.844381
5  1.050471  0.735425  0.435364 -0.240895 -1.215186
6  0.722506  1.076963  0.545667 -1.635789 -1.275542
7 -0.289325 -0.238281  0.952617 -0.144314  0.437175
8  0.897783 -0.674219  1.179446  1.552766  1.230427
9  0.984672  0.604761 -0.755868 -1.388132  0.026702

Array 10-por-5 de amostras de uma N(3, 6.25):

In [44]:
2.5 * np.random.randn(10, 5) + 3

array([[ 1.13713092, -0.65667234,  6.86011889,  2.21293345,  6.40933034],
       [ 3.80212764,  6.23532489,  3.03578901,  3.3571802 ,  1.97479295],
       [ 0.1979196 ,  1.60773748,  7.08944594,  0.40267677,  2.25284657],
       [ 2.00344392,  2.16107692, -0.12005008,  1.31722153,  4.51890758],
       [ 5.1559003 , -1.35151051,  3.73163015,  1.33512521,  4.61359322],
       [-0.15469793,  4.95172918,  5.16472754,  1.16428645,  0.67232143],
       [ 5.24577372,  4.09955443,  6.77917565,  6.67817015,  1.96027738],
       [ 1.67450324, -0.73112115,  5.44766853,  2.30371409,  1.73138645],
       [ 2.08755658,  1.38334175,  3.91605329,  4.73516206,  7.54265467],
       [ 1.96095057,  5.57456015,  4.35924518,  0.40759389,  2.76521989]])

In [45]:
df_N3 = pd.DataFrame(2.5 * np.random.randn(1000000, 5) + 3)

In [46]:
df_N3

               0         1         2         3         4
0       9.304184  7.049397  0.949436  1.780681  2.753253
1      -1.591356  4.388378  0.799787  4.942606  7.398327
2       1.106825  3.647945  4.262882  1.938042  3.382277
3       4.196403  4.788728  5.086836  1.791755  2.210196
4       0.647857  3.109693  5.270159  5.042029 -1.015805
...          ...       ...       ...       ...       ...
999995  4.685775  7.308961  4.186600  2.307876  5.008472
999996  3.515232  1.536897  2.499319  9.574790  3.570077
999997  2.685452  7.616182  7.357554  2.381461  5.504153
999998  4.703496  2.480500  5.575493  2.442857  7.280765
999999  3.540161  4.075161  2.435527  4.013901  5.451683

[1000000 rows x 5 columns]

In [47]:
data = {
'País': ['Bélgica', 'Índia', 'Brasil'],
'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília'],
'População': [123465, 456789, 987654]
}

In [48]:
data

{'País': ['Bélgica', 'Índia', 'Brasil'],
 'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília'],
 'População': [123465, 456789, 987654]}

In [50]:
data['Capital']

['Bruxelas', 'Nova Delhi', 'Brasília']

In [51]:
df3 = pd.DataFrame(data, columns=['País','Capital','População'])

In [52]:
df3

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

Podemos criar a mesma base através de uma lista de vários json's

In [53]:
data = [{"País":"Bélgica","Capital":"Bruxelas","População":123465},
        {"País":"Índia","Capital":"Nova Delhi","População":456789},
        {"País":"Brasil","Capital":"Brasília","População":987654}]

In [54]:
data

[{'País': 'Bélgica', 'Capital': 'Bruxelas', 'População': 123465},
 {'País': 'Índia', 'Capital': 'Nova Delhi', 'População': 456789},
 {'País': 'Brasil', 'Capital': 'Brasília', 'População': 987654}]

In [81]:
df4 = pd.DataFrame(data)

In [82]:
df4

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

In [57]:
df4.drop([0,1], inplace=True)

In [58]:
df4

     País   Capital  População
2  Brasil  Brasília     987654

É possível apagar linhas de um dataframe através do índice

In [59]:
df3 = df3.drop([0, 1], axis=0)

In [60]:
df3

     País   Capital  População
2  Brasil  Brasília     987654

In [61]:
df3.drop(["Capital","População"],axis=1)

     País
2  Brasil

In [62]:
df3.to_csv("p.csv")

In [63]:
h = pd.read_csv("p.csv")

In [64]:
h

   Unnamed: 0    País   Capital  População
0           2  Brasil  Brasília     987654

In [65]:
df3

     País   Capital  População
2  Brasil  Brasília     987654

In [66]:
df3.reset_index()

   index    País   Capital  População
0      2  Brasil  Brasília     987654

In [67]:
np

In [68]:
np.nan

nan

In [69]:
g = [('bird', 389.0),('bird', 24.0),('mammal', 80.5),('mammal', np.nan)]

In [70]:
g

[('bird', 389.0), ('bird', 24.0), ('mammal', 80.5), ('mammal', nan)]

In [71]:
pd.DataFrame(g)

        0      1
0    bird  389.0
1    bird   24.0
2  mammal   80.5
3  mammal    NaN

In [72]:
df = pd.DataFrame(g,index=['falcon', 'parrot', 'lion', 'monkey'],columns=('class', 'max_speed'))

In [73]:
df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [74]:
joao = [('falcon', 389.0),('parrot', 24.0),('lion', 80.5),('monkey', np.nan)]

In [75]:
df = pd.DataFrame(joao,index=['bird', 'bird', 'mammal', 'mammal'],columns=('class', 'max_speed'))

In [76]:
df

         class  max_speed
bird    falcon      389.0
bird    parrot       24.0
mammal    lion       80.5
mammal  monkey        NaN

In [77]:
df.reset_index()

    index   class  max_speed
0    bird  falcon      389.0
1    bird  parrot       24.0
2  mammal    lion       80.5
3  mammal  monkey        NaN

In [83]:
df3 = df4

In [84]:
df3

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

In [85]:
df3[['População','Capital']]

   População     Capital
0     123465    Bruxelas
1     456789  Nova Delhi
2     987654    Brasília

In [86]:
df3['País']

0    Bélgica
1      Índia
2     Brasil
Name: País, dtype: object

Ou remover colunas utilizando o argumento axis=1

In [87]:
df3.drop(['País','População'], axis=1)

      Capital
0    Bruxelas
1  Nova Delhi
2    Brasília

Coletando informações básicas sobre o DataFrame: 

Quantidade de linhas e colunas do DataFrame

In [88]:
df3.shape

(3, 3)

Descrição do Index

In [89]:
df3.index

RangeIndex(start=0, stop=3, step=1)

In [90]:
list(df3)

['País', 'Capital', 'População']

Colunas presentes no DataFrame

In [91]:
df3.columns

Index(['País', 'Capital', 'População'], dtype='object')

Contagem de dados não-nulos

In [92]:
df3.count()

País         3
Capital      3
População    3
dtype: int64

In [93]:
c = df3.count()

In [94]:
c

País         3
Capital      3
População    3
dtype: int64

In [95]:
df3

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

Criando uma nova coluna em um DataFrame

In [96]:
df3['Nova_Coluna'] = 0

In [97]:
df3['Nova_Coluna1'] = df3['População']**2

In [98]:
df3

      País     Capital  População  Nova_Coluna  Nova_Coluna1
0  Bélgica    Bruxelas     123465            0   15243606225
1    Índia  Nova Delhi     456789            0  208656190521
2   Brasil    Brasília     987654            0  975460423716

In [99]:
df3['Nova_Coluna'] = 10

In [100]:
df3

      País     Capital  População  Nova_Coluna  Nova_Coluna1
0  Bélgica    Bruxelas     123465           10   15243606225
1    Índia  Nova Delhi     456789           10  208656190521
2   Brasil    Brasília     987654           10  975460423716

In [101]:
df3.columns

Index(['País', 'Capital', 'População', 'Nova_Coluna', 'Nova_Coluna1'], dtype='object')

Renomeando colunas de um DataFrame

Se seu DataFrame possui 3 colunas, passe 3 novos valores em uma lista

In [102]:
df3.columns = ['Coluna 1', 'Coluna 2', 'Coluna 3', 'Coluna 4','Coluna 5']

In [103]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5
0  Bélgica    Bruxelas    123465        10   15243606225
1    Índia  Nova Delhi    456789        10  208656190521
2   Brasil    Brasília    987654        10  975460423716

In [104]:
df3.rename(columns={"Coluna 4": "Sofia"})

  Coluna 1    Coluna 2  Coluna 3  Sofia      Coluna 5
0  Bélgica    Bruxelas    123465     10   15243606225
1    Índia  Nova Delhi    456789     10  208656190521
2   Brasil    Brasília    987654     10  975460423716

In [105]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5
0  Bélgica    Bruxelas    123465        10   15243606225
1    Índia  Nova Delhi    456789        10  208656190521
2   Brasil    Brasília    987654        10  975460423716

Resumo dos dados

Soma dos valores de um DataFrame

In [106]:
df3.sum()

Coluna 1            BélgicaÍndiaBrasil
Coluna 2    BruxelasNova DelhiBrasília
Coluna 3                       1567908
Coluna 4                            30
Coluna 5                 1199360220462
dtype: object

Menor valor de um DataFrame

In [107]:
df3.min()

Coluna 1         Brasil
Coluna 2       Brasília
Coluna 3         123465
Coluna 4             10
Coluna 5    15243606225
dtype: object

Maior valor

In [108]:
df3.max()

Coluna 1           Índia
Coluna 2      Nova Delhi
Coluna 3          987654
Coluna 4              10
Coluna 5    975460423716
dtype: object

In [109]:
df3['Coluna 4'].sum()

30

In [110]:
df3['Coluna 3']

0    123465
1    456789
2    987654
Name: Coluna 3, dtype: int64

Index do menor valor

In [111]:
df3["Coluna 3"].idxmin()

0

Index do maior valor

In [112]:
df3["Coluna 3"].idxmax()

2

In [113]:
df3.describe()

            Coluna 3  Coluna 4      Coluna 5
count       3.000000       3.0  3.000000e+00
mean   522636.000000      10.0  3.997867e+11
std    435841.172317       0.0  5.078408e+11
min    123465.000000      10.0  1.524361e+10
25%    290127.000000      10.0  1.119499e+11
50%    456789.000000      10.0  2.086562e+11
75%    722221.500000      10.0  5.920583e+11
max    987654.000000      10.0  9.754604e+11

In [114]:
df_N3.describe()

,0,1,2,3,4
count,1000000.000000,1000000.000000,1000000.000000,1000000.000000,1000000.000000
mean,2.998534,2.998239,2.998057,2.996290,3.000458
std,2.499591,2.498001,2.499250,2.497694,2.499488
min,-8.750270,-9.146553,-8.548470,-9.068712,-9.295679
25%,1.311865,1.311910,1.310136,1.309412,1.314885
50%,2.999539,2.996848,3.001022,2.996453,3.003181
75%,4.685346,4.682244,4.685295,4.682198,4.685286
max,15.125428,15.392178,14.971129,15.054953,13.872244

Resumo estatístico do DataFrame, com quartis, mediana, etc.

In [115]:
lipe = df3.describe()

In [116]:
lipe.to_latex()

/var/folders/j0/5s6rknpd2j1bczb130mw14cm0000gn/T/ipykernel_77057/440450807.py:1: FutureWarning: In future versions `DataFrame.to_latex` is expected to utilise the base implementation of `Styler.to_latex` for formatting and rendering. The arguments signature may therefore change. It is recommended instead to use `DataFrame.style.to_latex` which also contains additional functionality.
  lipe.to_latex()

'\\begin{tabular}{lrrr}\n\\toprule\n{} &       Coluna 3 &  Coluna 4 &      Coluna 5 \\\\\n\\midrule\ncount &       3.000000 &       3.0 &  3.000000e+00 \\\\\nmean  &  522636.000000 &      10.0 &  3.997867e+11 \\\\\nstd   &  435841.172317 &       0.0 &  5.078408e+11 \\\\\nmin   &  123465.000000 &      10.0 &  1.524361e+10 \\\\\n25\\%   &  290127.000000 &      10.0 &  1.119499e+11 \\\\\n50\\%   &  456789.000000 &      10.0 &  2.086562e+11 \\\\\n75\\%   &  722221.500000 &      10.0 &  5.920583e+11 \\\\\nmax   &  987654.000000 &      10.0 &  9.754604e+11 \\\\\n\\bottomrule\n\\end{tabular}\n'

Vamos utilizar nossa base gerada a partir de uma Normal com média 3 e desvio 2.5

In [117]:
df_N3.describe()

,0,1,2,3,4
count,1000000.000000,1000000.000000,1000000.000000,1000000.000000,1000000.000000
mean,2.998534,2.998239,2.998057,2.996290,3.000458
std,2.499591,2.498001,2.499250,2.497694,2.499488
min,-8.750270,-9.146553,-8.548470,-9.068712,-9.295679
25%,1.311865,1.311910,1.310136,1.309412,1.314885
50%,2.999539,2.996848,3.001022,2.996453,3.003181
75%,4.685346,4.682244,4.685295,4.682198,4.685286
max,15.125428,15.392178,14.971129,15.054953,13.872244

In [118]:
df_N3.describe(percentiles=[.10, .25, .5, .65 , .75])

,0,1,2,3,4
count,1000000.000000,1000000.000000,1000000.000000,1000000.000000,1000000.000000
mean,2.998534,2.998239,2.998057,2.996290,3.000458
std,2.499591,2.498001,2.499250,2.497694,2.499488
min,-8.750270,-9.146553,-8.548470,-9.068712,-9.295679
10%,-0.200924,-0.199529,-0.205266,-0.209119,-0.204117
25%,1.311865,1.311910,1.310136,1.309412,1.314885
50%,2.999539,2.996848,3.001022,2.996453,3.003181
65%,3.961957,3.958508,3.964285,3.958027,3.964657
75%,4.685346,4.682244,4.685295,4.682198,4.685286
max,15.125428,15.392178,14.971129,15.054953,13.872244

Média dos valores

In [119]:
df3.mean()

/var/folders/j0/5s6rknpd2j1bczb130mw14cm0000gn/T/ipykernel_77057/3891983329.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.mean()

Coluna 3    5.226360e+05
Coluna 4    1.000000e+01
Coluna 5    3.997867e+11
dtype: float64

Mediana dos valores

In [120]:
df3.median()

/var/folders/j0/5s6rknpd2j1bczb130mw14cm0000gn/T/ipykernel_77057/3131045010.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.median()

Coluna 3    4.567890e+05
Coluna 4    1.000000e+01
Coluna 5    2.086562e+11
dtype: float64

#### Funções Lambda

A função lambda é uma função anonima

Ela pode receber qualquer número de argumentos, mas só pode ter uma expressão.

In [121]:
def teste(a):
    b = a*3
    return b

In [122]:
teste(4)

12

In [123]:
(lambda a : a * 3)(4)

12

In [124]:
(lambda a : a + 10)(10)

20

In [125]:
x = lambda a : a + 10
x(10)

20

In [126]:
d = lambda x:  x[0] - 2 * x[1] + 2

In [127]:
d([1,2])

-1

In [128]:
x = lambda a, b : a * b

In [129]:
x(5, 6)

30

In [130]:
def myfunc(n):
    return lambda a : a * n

In [131]:
mydoubler = myfunc(2)

In [132]:
mydoubler

In [133]:
mydoubler(11)

22

In [134]:
mytripler = myfunc(3)

In [135]:
mytripler(11)

33

In [136]:
myquad = myfunc(4)

In [138]:
myquad(11)

44

In [139]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5
0  Bélgica    Bruxelas    123465        10   15243606225
1    Índia  Nova Delhi    456789        10  208656190521
2   Brasil    Brasília    987654        10  975460423716

In [140]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5
0  Bélgica    Bruxelas    123465        10   15243606225
1    Índia  Nova Delhi    456789        10  208656190521
2   Brasil    Brasília    987654        10  975460423716

In [141]:
df3['Col4'] = 10

In [142]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Col4
0  Bélgica    Bruxelas    123465        10   15243606225    10
1    Índia  Nova Delhi    456789        10  208656190521    10
2   Brasil    Brasília    987654        10  975460423716    10

Aplicando funções:

Aplicando uma função que substitui 0 por 1

In [143]:
df3.apply(lambda x: x.replace(10, 1))

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Col4
0  Bélgica    Bruxelas    123465         1   15243606225     1
1    Índia  Nova Delhi    456789         1  208656190521     1
2   Brasil    Brasília    987654         1  975460423716     1

Ordenando valores:

Ordenando em ordem crescente

In [146]:
df3.columns = ['Coluna 1','Coluna 2','Coluna 3','Coluna 4', 'Coluna 5', 'Coluna 6']

In [147]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6
0  Bélgica    Bruxelas    123465        10   15243606225        10
1    Índia  Nova Delhi    456789        10  208656190521        10
2   Brasil    Brasília    987654        10  975460423716        10

In [148]:
df3.sort_values(by='Coluna 3')

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6
0  Bélgica    Bruxelas    123465        10   15243606225        10
1    Índia  Nova Delhi    456789        10  208656190521        10
2   Brasil    Brasília    987654        10  975460423716        10

Ordenando em ordem decrescente

In [149]:
df3.sort_values(by='Coluna 3',ascending=False)

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6
2   Brasil    Brasília    987654        10  975460423716        10
1    Índia  Nova Delhi    456789        10  208656190521        10
0  Bélgica    Bruxelas    123465        10   15243606225        10

Selecionando valores: 

Selecionando a primeira linha da coluna país

loc: seleciona linhas (ou colunas) com labels particulares do index.

iloc: seleciona linhas (ou colunas) em posições particulares do index (assume número inteiro).

In [150]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6
0  Bélgica    Bruxelas    123465        10   15243606225        10
1    Índia  Nova Delhi    456789        10  208656190521        10
2   Brasil    Brasília    987654        10  975460423716        10

In [151]:
df3['NC'] = 100

In [152]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0  Bélgica    Bruxelas    123465        10   15243606225        10  100
1    Índia  Nova Delhi    456789        10  208656190521        10  100
2   Brasil    Brasília    987654        10  975460423716        10  100

In [153]:
df3.index

RangeIndex(start=0, stop=3, step=1)

In [154]:
df3.loc[0]

Coluna 1        Bélgica
Coluna 2       Bruxelas
Coluna 3         123465
Coluna 4             10
Coluna 5    15243606225
Coluna 6             10
NC                  100
Name: 0, dtype: object

In [155]:
df3.iloc[0:2]

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0  Bélgica    Bruxelas    123465        10   15243606225        10  100
1    Índia  Nova Delhi    456789        10  208656190521        10  100

In [156]:
dfp = df3.drop(1)

In [157]:
dfp

  Coluna 1  Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0  Bélgica  Bruxelas    123465        10   15243606225        10  100
2   Brasil  Brasília    987654        10  975460423716        10  100

In [158]:
dfp.iloc[1]

Coluna 1          Brasil
Coluna 2        Brasília
Coluna 3          987654
Coluna 4              10
Coluna 5    975460423716
Coluna 6              10
NC                   100
Name: 2, dtype: object

In [159]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0  Bélgica    Bruxelas    123465        10   15243606225        10  100
1    Índia  Nova Delhi    456789        10  208656190521        10  100
2   Brasil    Brasília    987654        10  975460423716        10  100

In [160]:
df3["Coluna 1"] == 'Brasil'

0    False
1    False
2     True
Name: Coluna 1, dtype: bool

In [161]:
df3[df3["Coluna 1"] == 'Brasil']

  Coluna 1  Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
2   Brasil  Brasília    987654        10  975460423716        10  100

In [162]:
df3[df3["Coluna 1"] == 'Bélgica']

  Coluna 1  Coluna 2  Coluna 3  Coluna 4     Coluna 5  Coluna 6   NC
0  Bélgica  Bruxelas    123465        10  15243606225        10  100

In [163]:
df3[df3["Coluna 3"] >= 123475]

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
1    Índia  Nova Delhi    456789        10  208656190521        10  100
2   Brasil    Brasília    987654        10  975460423716        10  100

In [164]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0  Bélgica    Bruxelas    123465        10   15243606225        10  100
1    Índia  Nova Delhi    456789        10  208656190521        10  100
2   Brasil    Brasília    987654        10  975460423716        10  100

In [165]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0  Bélgica    Bruxelas    123465        10   15243606225        10  100
1    Índia  Nova Delhi    456789        10  208656190521        10  100
2   Brasil    Brasília    987654        10  975460423716        10  100

In [166]:
df3.loc[0]

Coluna 1        Bélgica
Coluna 2       Bruxelas
Coluna 3         123465
Coluna 4             10
Coluna 5    15243606225
Coluna 6             10
NC                  100
Name: 0, dtype: object

In [167]:
df3.loc[0, 'Coluna 1'] = "Kyev"

In [168]:
df3.iloc[0]['Coluna 3']

123465

In [169]:
df3[['Coluna 3','Coluna 2']]

   Coluna 3    Coluna 2
0    123465    Bruxelas
1    456789  Nova Delhi
2    987654    Brasília

In [170]:
df3

  Coluna 1    Coluna 2  Coluna 3  Coluna 4      Coluna 5  Coluna 6   NC
0     Kyev    Bruxelas    123465        10   15243606225        10  100
1    Índia  Nova Delhi    456789        10  208656190521        10  100
2   Brasil    Brasília    987654        10  975460423716        10  100

Suponha, agora, que queremos importar a base de dados AUTO em ".dta".

In [171]:
df4 = pd.read_stata("auto.dta")

In [172]:
df4

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic
...,...,...,...,...,...,...,...,...,...,...,...,...
69,VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
70,VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
71,VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
72,VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
73,Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

In [173]:
list(df4)

['make',
 'price',
 'mpg',
 'rep78',
 'headroom',
 'trunk',
 'weight',
 'length',
 'turn',
 'displacement',
 'gear_ratio',
 'foreign']

In [174]:
df4.dtypes

make              object
price              int16
mpg                int16
rep78            float64
headroom         float32
trunk              int16
weight             int16
length             int16
turn               int16
displacement       int16
gear_ratio       float32
foreign         category
dtype: object

In [175]:
df4.columns

Index(['make', 'price', 'mpg', 'rep78', 'headroom', 'trunk', 'weight',
       'length', 'turn', 'displacement', 'gear_ratio', 'foreign'],
      dtype='object')

In [176]:
df4.head(7)

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic
5,Buick LeSabre,5788,18,3.0,4.0,21,3670,218,43,231,2.73,Domestic
6,Buick Opel,4453,26,NaN,3.0,10,2230,170,34,304,2.87,Domestic

In [177]:
df4.tail()

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
69,VW Dasher,7140,23,4.0,2.5,12,2160,172,36,97,3.74,Foreign
70,VW Diesel,5397,41,5.0,3.0,15,2040,155,35,90,3.78,Foreign
71,VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign
72,VW Scirocco,6850,25,4.0,2.0,16,1990,156,36,97,3.78,Foreign
73,Volvo 260,11995,17,5.0,2.5,14,3170,193,37,163,2.98,Foreign

In [178]:
df4.sample(n=10)

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
23,Ford Fiesta,4389,28,4.0,1.5,9,1800,147,33,98,3.15,Domestic
55,Datsun 200,6229,23,4.0,1.5,6,2370,170,35,119,3.89,Foreign
40,Olds Toronado,10371,16,3.0,3.5,17,4030,206,43,350,2.41,Domestic
42,Plym. Champ,4425,34,5.0,2.5,11,1800,157,37,86,2.97,Domestic
10,Cad. Deville,11385,14,3.0,4.0,20,4330,221,44,425,2.28,Domestic
21,Dodge Magnum,5886,16,2.0,4.0,17,3600,206,46,318,2.47,Domestic
18,Chev. Nova,3955,19,3.0,3.5,13,3430,197,43,250,2.56,Domestic
27,Linc. Versailles,13466,14,3.0,3.5,15,3830,201,41,302,2.47,Domestic
53,Audi Fox,6295,23,3.0,2.5,11,2070,174,36,97,3.70,Foreign
71,VW Rabbit,4697,25,4.0,3.0,15,1930,155,35,89,3.78,Foreign

In [179]:
df4["price"]

0      4099
1      4749
2      3799
3      4816
4      7827
      ...
69     7140
70     5397
71     4697
72     6850
73    11995
Name: price, Length: 74, dtype: int16

In [180]:
df4["price"].max()

15906

In [181]:
df4[df4["price"] == df4["price"].max()]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
12,Cad. Seville,15906,21,3.0,3.0,13,4290,204,45,350,2.24,Domestic

In [182]:
df4[df4["price"] == df4["price"].min()]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
33,Merc. Zephyr,3291,20,3.0,3.5,17,2830,195,43,140,3.08,Domestic

In [183]:
df4[df4["price"] == 15906]

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
12,Cad. Seville,15906,21,3.0,3.0,13,4290,204,45,350,2.24,Domestic

In [184]:
len(df4)

74

In [185]:
for i in range(len(df4)):
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73

In [188]:
for i in range(len(df4)):
    preco = df4.iloc[i]['price']
    if preco == 15906:
        print(df4.iloc[i])
    else:
        continue # pass
        print("Jose")

make            Cad. Seville
price                  15906
mpg                       21
rep78                    3.0
headroom                 3.0
trunk                     13
weight                  4290
length                   204
turn                      45
displacement             350
gear_ratio              2.24
foreign             Domestic
Name: 12, dtype: object

In [189]:
for i in range(len(df4)):
    preco = df4.iloc[i]['price']
    if preco == 15906:
        print(df4.iloc[i])
    else:
        continue

make            Cad. Seville
price                  15906
mpg                       21
rep78                    3.0
headroom                 3.0
trunk                     13
weight                  4290
length                   204
turn                      45
displacement             350
gear_ratio              2.24
foreign             Domestic
Name: 12, dtype: object

In [190]:
df4.sort_values(by='price',ascending=False).tail(10)

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
19,Dodge Colt,3984,30,5.0,2.0,8,2120,163,35,98,3.54,Domestic
18,Chev. Nova,3955,19,3.0,3.5,13,3430,197,43,250,2.56,Domestic
64,Renault Le Car,3895,26,3.0,3.0,10,1830,142,34,79,3.72,Foreign
28,Merc. Bobcat,3829,22,4.0,3.0,9,2580,169,39,140,2.73,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
65,Subaru,3798,35,5.0,2.5,11,2050,164,36,97,3.81,Foreign
67,Toyota Corolla,3748,31,5.0,3.0,9,2200,165,35,97,3.21,Foreign
17,Chev. Monza,3667,24,2.0,2.0,7,2750,179,40,151,2.73,Domestic
13,Chev. Chevette,3299,29,3.0,2.5,9,2110,163,34,231,2.93,Domestic
33,Merc. Zephyr,3291,20,3.0,3.5,17,2830,195,43,140,3.08,Domestic

In [191]:
df_N3[0].sum()

2998533.948325042

In [192]:
print('Soma: ',         df4["price"].sum())
print('Valor máximo: ', df4["price"].max())
print('Valor mínimo: ', df4["price"].min())
print('Média',          df4["price"].mean())

Soma:  456229
Valor máximo:  15906
Valor mínimo:  3291
Média 6165.256756756757

Um outro comando bastante útil é o "value_counts". Com ele podemos contar a frequência de cada valor em um columa não numérica.

In [193]:
df4["foreign"].value_counts()

Domestic    52
Foreign     22
Name: foreign, dtype: int64

Pode-se, então, criar uma sub-base de dados baseada em valores específicos de uma coluna. Por exemplo, imagine que queremos apenas as informações dos carros importados.

In [194]:
carros_importados = df4[df4["foreign"] == 'Foreign']

In [93]:
carros_importados.to_stata("autos_importados.dta")

In [195]:
df4_impot = df4[df4["foreign"] == 'Foreign'] # Dados carros importados
df4_nacio = df4[df4["foreign"] == 'Domestic']

In [196]:
df4_impot.head()

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
52,Audi 5000,9690,17,5.0,3.0,15,2830,189,37,131,3.20,Foreign
53,Audi Fox,6295,23,3.0,2.5,11,2070,174,36,97,3.70,Foreign
54,BMW 320i,9735,25,4.0,2.5,12,2650,177,34,121,3.64,Foreign
55,Datsun 200,6229,23,4.0,1.5,6,2370,170,35,119,3.89,Foreign
56,Datsun 210,4589,35,5.0,2.0,8,2020,165,32,85,3.70,Foreign

In [197]:
df4_nacio.head()

,make,price,mpg,rep78,headroom,trunk,weight,length,turn,displacement,gear_ratio,foreign
0,AMC Concord,4099,22,3.0,2.5,11,2930,186,40,121,3.58,Domestic
1,AMC Pacer,4749,17,3.0,3.0,11,3350,173,40,258,2.53,Domestic
2,AMC Spirit,3799,22,NaN,3.0,12,2640,168,35,121,3.08,Domestic
3,Buick Century,4816,20,3.0,4.5,16,3250,196,40,196,2.93,Domestic
4,Buick Electra,7827,15,4.0,4.0,20,4080,222,43,350,2.41,Domestic

Vamos observar o preço médio do carro importado.

In [198]:
print('Média Impot.: ',df4_impot["price"].mean())
print('Média Nacio.: ',df4_nacio["price"].mean())

Média Impot.:  6384.681818181818
Média Nacio.:  6072.423076923077

In [199]:
df_filmes = pd.DataFrame(columns=('name', 'obs', 'rate'))

In [200]:
df_filmes

Empty DataFrame
Columns: [name, obs, rate]
Index: []

In [201]:
len(df_filmes)

0

In [202]:
df_filmes.loc[0] = ['Teste', '50', '4']

In [203]:
df_filmes

    name obs rate
0  Teste  50    4

In [204]:
len(df_filmes)

1

In [205]:
df_filmes.loc[len(df_filmes)] = ['Rafaela', '50', '4']

In [206]:
df_filmes

      name obs rate
0    Teste  50    4
1  Rafaela  50    4

In [207]:
len(df_filmes)

2

In [208]:
df_filmes

      name obs rate
0    Teste  50    4
1  Rafaela  50    4

Deletar base de dados da memória

In [209]:
del(df_filmes)

In [210]:
df_filmes

NameError: name 'df_filmes' is not defined

In [211]:
df_filmes = pd.DataFrame(columns=('name', 'obs', 'rate'))

In [215]:
import requests
from bs4 import BeautifulSoup
import unicodedata
url = ['http://www.imdb.com/title/tt5013056/', 
       'http://www.imdb.com/title/tt1790809/',
       'http://www.imdb.com/title/tt1596346/',
       'http://www.imdb.com/title/tt0092099/',
       'http://www.imdb.com/title/tt0108052/']

In [216]:
headers = {
    "accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9",
    "accept-encoding": "gzip, deflate, br",
    "accept-language": "en-US,en;q=0.9",
    "sec-ch-ua": "'Not?A_Brand';v='8', 'Chromium';v='108', 'Google Chrome';v='108'",
    "sec-ch-ua-mobile": "?0",
    "sec-ch-ua-platform": "'macOS'",
    "sec-fetch-dest": "document",
    "sec-fetch-mode": "navigate",
    "sec-fetch-site": "none",
    "sec-fetch-user": "?1",
    "upgrade-insecure-requests": "1",
    "user-agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/108.0.0.0 Safari/537.36"}

In [213]:
def strip_accents(s):
    return ''.join(c for c in unicodedata.normalize('NFD', s) if unicodedata.category(c) != 'Mn')

In [214]:
df_filmes

Empty DataFrame
Columns: [name, obs, rate]
Index: []

In [217]:
for item in url:
    response = requests.get(item, headers=headers)
    soup = BeautifulSoup(response.text, 'lxml')
    name = strip_accents(soup.title.text)
    rate = soup.find_all("span", attrs={"class": "sc-bde20123-1 iZlgcd"})[0].text
    obs = soup.find_all("div", attrs={"class": "sc-bde20123-3 bjjENQ"})[0].text
    #print(name, obs, rate)
    df_filmes.loc[len(df_filmes)] = [name, obs, rate]

In [218]:
df_filmes

                                                name   obs rate
0                              Dunkirk (2017) - IMDb  713K  7.8
1  Pirates of the Caribbean: Dead Men Tell No Tal...  333K  6.5
2                          Soul Surfer (2011) - IMDb   52K  7.0
3                              Top Gun (1986) - IMDb  485K  6.9
4                     Schindler's List (1993) - IMDb  1.4M  9.0

In [219]:
df_filmes.dtypes

name    object
obs     object
rate    object
dtype: object

Podemos observar o tipo de variável. No caso de rate, ela é um object. Ou seja, não numérica.

In [220]:
df_filmes["obs"].max()

'713K'

Neste caso, não conseguimos obter estatísticas

In [221]:
df_filmes["rate"].sum()

'7.86.57.06.99.0'

In [222]:
pd.to_numeric(df_filmes["rate"])

0    7.8
1    6.5
2    7.0
3    6.9
4    9.0
Name: rate, dtype: float64

Mas podemos converter:

In [223]:
df_filmes["rate"] = pd.to_numeric(df_filmes["rate"])

In [224]:
df_filmes

                                                name   obs  rate
0                              Dunkirk (2017) - IMDb  713K   7.8
1  Pirates of the Caribbean: Dead Men Tell No Tal...  333K   6.5
2                          Soul Surfer (2011) - IMDb   52K   7.0
3                              Top Gun (1986) - IMDb  485K   6.9
4                     Schindler's List (1993) - IMDb  1.4M   9.0

In [225]:
df_filmes["rate"]

0    7.8
1    6.5
2    7.0
3    6.9
4    9.0
Name: rate, dtype: float64

In [226]:
df_filmes["rate"].sum()

37.2

In [227]:
df_filmes.dtypes

name     object
obs      object
rate    float64
dtype: object

In [228]:
print(df_filmes["rate"].sum())
print(df_filmes["rate"].max())
print(df_filmes["rate"].min())
print(df_filmes["rate"].mean())

37.2
9.0
6.5
7.44

In [229]:
df_filmes

                                                name   obs  rate
0                              Dunkirk (2017) - IMDb  713K   7.8
1  Pirates of the Caribbean: Dead Men Tell No Tal...  333K   6.5
2                          Soul Surfer (2011) - IMDb   52K   7.0
3                              Top Gun (1986) - IMDb  485K   6.9
4                     Schindler's List (1993) - IMDb  1.4M   9.0

In [230]:
df_filmes["obs"] = df_filmes["obs"].apply(lambda x: x.replace("K", "000").replace("M", "00000").replace(".", ""))

In [231]:
df_filmes

                                                name      obs  rate
0                              Dunkirk (2017) - IMDb   713000   7.8
1  Pirates of the Caribbean: Dead Men Tell No Tal...   333000   6.5
2                          Soul Surfer (2011) - IMDb    52000   7.0
3                              Top Gun (1986) - IMDb   485000   6.9
4                     Schindler's List (1993) - IMDb  1400000   9.0

In [232]:
df_filmes["obs"] = pd.to_numeric(df_filmes["obs"])

In [233]:
df_filmes.dtypes

name     object
obs       int64
rate    float64
dtype: object

In [234]:
df_filmes

                                                name      obs  rate
0                              Dunkirk (2017) - IMDb   713000   7.8
1  Pirates of the Caribbean: Dead Men Tell No Tal...   333000   6.5
2                          Soul Surfer (2011) - IMDb    52000   7.0
3                              Top Gun (1986) - IMDb   485000   6.9
4                     Schindler's List (1993) - IMDb  1400000   9.0

In [235]:
pd.get_dummies(df_filmes['name'], prefix="dum")

,dum_Dunkirk (2017) - IMDb,dum_Pirates of the Caribbean: Dead Men Tell No Tales (2017) - IMDb,dum_Schindler's List (1993) - IMDb,dum_Soul Surfer (2011) - IMDb,dum_Top Gun (1986) - IMDb
0,1,0,0,0,0
1,0,1,0,0,0
2,0,0,0,1,0
3,0,0,0,0,1
4,0,0,1,0,0

Uma outra operação importante é obter dummies. Iremos criar uma outra base com a dummies e depois juntar a base original

In [236]:
df_dum = pd.get_dummies(df_filmes['name'])

In [237]:
df_dum

,Dunkirk (2017) - IMDb,Pirates of the Caribbean: Dead Men Tell No Tales (2017) - IMDb,Schindler's List (1993) - IMDb,Soul Surfer (2011) - IMDb,Top Gun (1986) - IMDb
0,1,0,0,0,0
1,0,1,0,0,0
2,0,0,0,1,0
3,0,0,0,0,1
4,0,0,1,0,0

Podemos usar o comando ``pd.concat``para concatenar as duas bases

In [238]:
pd.concat([df_filmes, df_dum])

,name,obs,rate,Dunkirk (2017) - IMDb,Pirates of the Caribbean: Dead Men Tell No Tales (2017) - IMDb,Schindler's List (1993) - IMDb,Soul Surfer (2011) - IMDb,Top Gun (1986) - IMDb
0,Dunkirk (2017) - IMDb,713000.0,7.8,NaN,NaN,NaN,NaN,NaN
1,Pirates of the Caribbean: Dead Men Tell No Tal...,333000.0,6.5,NaN,NaN,NaN,NaN,NaN
2,Soul Surfer (2011) - IMDb,52000.0,7.0,NaN,NaN,NaN,NaN,NaN
3,Top Gun (1986) - IMDb,485000.0,6.9,NaN,NaN,NaN,NaN,NaN
4,Schindler's List (1993) - IMDb,1400000.0,9.0,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,1.0,0.0,0.0,0.0,0.0
1,NaN,NaN,NaN,0.0,1.0,0.0,0.0,0.0
2,NaN,NaN,NaN,0.0,0.0,0.0,1.0,0.0
3,NaN,NaN,NaN,0.0,0.0,0.0,0.0,1.0
4,NaN,NaN,NaN,0.0,0.0,1.0,0.0,0.0

In [239]:
df_filmes = pd.concat([df_filmes, df_dum], axis=1)

In [240]:
df_filmes

,name,obs,rate,Dunkirk (2017) - IMDb,Pirates of the Caribbean: Dead Men Tell No Tales (2017) - IMDb,Schindler's List (1993) - IMDb,Soul Surfer (2011) - IMDb,Top Gun (1986) - IMDb
0,Dunkirk (2017) - IMDb,713000,7.8,1,0,0,0,0
1,Pirates of the Caribbean: Dead Men Tell No Tal...,333000,6.5,0,1,0,0,0
2,Soul Surfer (2011) - IMDb,52000,7.0,0,0,0,1,0
3,Top Gun (1986) - IMDb,485000,6.9,0,0,0,0,1
4,Schindler's List (1993) - IMDb,1400000,9.0,0,0,1,0,0

In [242]:
df_filmes.style.to_latex()

"\\begin{tabular}{llrrrrrrr}\n & name & obs & rate & Dunkirk (2017) - IMDb & Pirates of the Caribbean: Dead Men Tell No Tales (2017) - IMDb & Schindler's List (1993) - IMDb & Soul Surfer (2011) - IMDb & Top Gun (1986) - IMDb \\\\\n0 & Dunkirk (2017) - IMDb & 713000 & 7.800000 & 1 & 0 & 0 & 0 & 0 \\\\\n1 & Pirates of the Caribbean: Dead Men Tell No Tales (2017) - IMDb & 333000 & 6.500000 & 0 & 1 & 0 & 0 & 0 \\\\\n2 & Soul Surfer (2011) - IMDb & 52000 & 7.000000 & 0 & 0 & 0 & 1 & 0 \\\\\n3 & Top Gun (1986) - IMDb & 485000 & 6.900000 & 0 & 0 & 0 & 0 & 1 \\\\\n4 & Schindler's List (1993) - IMDb & 1400000 & 9.000000 & 0 & 0 & 1 & 0 & 0 \\\\\n\\end{tabular}\n"

In [1]:
import pandas as pd
import pickle

In [3]:
df = pd.read_pickle('dados.pkl')

## Infrações IBAMA

In [251]:
import requests
from bs4 import BeautifulSoup
import pandas as pd
import multiprocessing as mp 
from joblib import Parallel, delayed
import time

In [252]:
num_cores = mp.cpu_count()

In [253]:
num_cores

8

In [254]:
from requests.adapters import HTTPAdapter
from urllib3.util.retry import Retry


session = requests.Session()
retry = Retry(connect=3, backoff_factor=0.5)
adapter = HTTPAdapter(max_retries=retry)
session.mount('http://', adapter)
session.mount('https://', adapter)

In [247]:
r = session.get("http://dadosabertos.ibama.gov.br/dados/SIFISC/auto_infracao/auto_infracao/auto_infracao.html", verify=False)

/opt/miniconda3/lib/python3.9/site-packages/urllib3/connectionpool.py:1045: InsecureRequestWarning: Unverified HTTPS request is being made to host 'dadosabertos.ibama.gov.br'. Adding certificate verification is strongly advised. See: https://urllib3.readthedocs.io/en/1.26.x/advanced-usage.html#ssl-warnings
  warnings.warn(

In [248]:
texto = r.text

In [260]:
texto[0:2000]

'<html><body><h1>AUTO DE INFRAÇÃO <br>Atualizado em: 01/10/2023 6:35</h1><table border="1" cellspacing="1" cellpadding="5"><thead bgcolor="#808080"><th align="center">SEQ AUTO INFRACAO</th><th align="center">NUM_AUTO_INFRACAO</th><th align="center">SER_AUTO_INFRACAO</th><th align="center">TIPO_AUTO</th><th align="center">TIPO_MULTA</th><th align="center">VAL_AUTO_INFRACAO</th><th align="center">PATRIMONIO_APURACAO</th><th align="center">PATRIMONIO_PORTE</th><th align="center">GRAVIDADE_INFRACAO</th><th align="center">UNID_ARRECADACAO</th><th align="center">DES_AUTO_INFRACAO</th><th align="center">DAT_HORA_AUTO_INFRACAO</th><th align="center">FORMA_ENTREGA</th><th align="center">DAT_CIENCIA_AUTUACAO</th><th align="center">COD_MUNICIPIO</th><th align="center">MUNICIPIO</th><th align="center">UF</th><th align="center">NUM_PROCESSO</th><th align="center">COD_INFRACAO</th><th align="center">DES_INFRACAO</th><th align="center">TIPO_INFRACAO</th><th align="center">NOME_INFRATOR</th><th align="center">CPF_CNPJ_INFRATOR</th><th align="center">QTD_AREA</th><th align="center">INFRACAO_AREA</th><th align="center">DES_OUTROS_TIPO_AREA</th><th align="center">CLASSIFICACAO_AREA</th><th align="center">NUM_LATITUDE_AUTO</th><th align="center">NUM_LONGITUDE_AUTO</th><th align="center">DES_LOCAL_INFRACAO</th><th align="center">NOTIFICACAO_VINCULADA</th><th align="center">ACAO_FISCALIZATORIA</th><th align="center">UNID_CONTROLE</th><th align="center">TIPO_ACAO</th><th align="center">OPERACAO</th><th align="center">DENUNCIA_SISLIV</th><th align="center">ORDEM_FISCALIZACAO</th><th align="center">SOLICITACAO_RECURSO</th><th align="center">OPERACAO_SOL_RECURSO</th><th align="center">DAT_LANCAMENTO</th><th align="center">DAT_ULT_ALTERACAO</th><th align="center">TIPO_ULT_ALTERACAO</th></thead><tbody><tr><td>3.0</td><td>26363</td><td>D</td><td>Multa simples</td><td></td><td>1500.0</td><td></td><td></td><td></td><td>IMP/GEREX</td><td>POR FUNCIONAR ESTABELICIMENTO PONTENCIALMENTE POLUIDORAS SEM '

In [256]:
texto[-1000:]

'<td></td><td>multa simples;</td><td>Fechada</td><td>5000.0</td><td></td><td></td><td></td><td></td><td>Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.</td><td>05/08/2022 17:46:40</td><td>Representante</td><td></td><td>4118709</td><td>Paulo Frontin</td><td>PR</td><td>02017.002161/2022-06</td><td>272491.0</td><td>Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.</td><td>Flora</td><td>Eliane Sfair dos Santos</td><td>01834887925</td><td></td><td>Atividade</td><td></td><td></td><td>-26,17136111111111</td><td>-50,73886111111111</td><td>Fazenda Chapéu de Sol</td><td></td><td></td><td>SUPES/PR</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>05/08/2022 17:51:56</td><td></td></tr></tbody></table></body></html>'

In [261]:
texto_0 = texto.split("</thead><tbody>")[0]
colunas = [item.text for item in BeautifulSoup(texto_0.split('<thead bgcolor="#808080">')[1],'lxml').find_all('th')]

In [262]:
colunas

['SEQ AUTO INFRACAO',
 'NUM_AUTO_INFRACAO',
 'SER_AUTO_INFRACAO',
 'TIPO_AUTO',
 'TIPO_MULTA',
 'VAL_AUTO_INFRACAO',
 'PATRIMONIO_APURACAO',
 'PATRIMONIO_PORTE',
 'GRAVIDADE_INFRACAO',
 'UNID_ARRECADACAO',
 'DES_AUTO_INFRACAO',
 'DAT_HORA_AUTO_INFRACAO',
 'FORMA_ENTREGA',
 'DAT_CIENCIA_AUTUACAO',
 'COD_MUNICIPIO',
 'MUNICIPIO',
 'UF',
 'NUM_PROCESSO',
 'COD_INFRACAO',
 'DES_INFRACAO',
 'TIPO_INFRACAO',
 'NOME_INFRATOR',
 'CPF_CNPJ_INFRATOR',
 'QTD_AREA',
 'INFRACAO_AREA',
 'DES_OUTROS_TIPO_AREA',
 'CLASSIFICACAO_AREA',
 'NUM_LATITUDE_AUTO',
 'NUM_LONGITUDE_AUTO',
 'DES_LOCAL_INFRACAO',
 'NOTIFICACAO_VINCULADA',
 'ACAO_FISCALIZATORIA',
 'UNID_CONTROLE',
 'TIPO_ACAO',
 'OPERACAO',
 'DENUNCIA_SISLIV',
 'ORDEM_FISCALIZACAO',
 'SOLICITACAO_RECURSO',
 'OPERACAO_SOL_RECURSO',
 'DAT_LANCAMENTO',
 'DAT_ULT_ALTERACAO',
 'TIPO_ULT_ALTERACAO']

In [263]:
texto_1 = texto.split("</thead><tbody>")[1]
texto_final = texto_1.split("</tbody></table>")[0]

In [264]:
texto_final[0:1000]

'<tr><td>3.0</td><td>26363</td><td>D</td><td>Multa simples</td><td></td><td>1500.0</td><td></td><td></td><td></td><td>IMP/GEREX</td><td>POR FUNCIONAR ESTABELICIMENTO PONTENCIALMENTE POLUIDORAS SEM O CADASTRO TECNICO FEDERAL SEM APRESENTAR RELATORIO ANUAL DE SUAS ATIVIDEDAS</td><td>05/03/2004 00:00:00</td><td></td><td>05/03/2004</td><td>2105302</td><td>IMPERATRIZ</td><td>MA</td><td>0205100001204</td><td>401001.0</td><td>Funcionar sem prévio registro no Ibama - Administradora</td><td>Penalidade pecuniária - Flora</td><td>PALADAR IOGURTE LTDA</td><td>01790868000103</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>-</td><td></td><td>IMP/GEREX</td><td>Rotina</td><td></td><td>/</td><td></td><td></td><td></td><td>01/06/2004 10:13:30</td><td>06/09/2010 10:09:03</td><td>Preenchido</td></tr><tr><td>4.0</td><td>26364</td><td>D</td><td>Multa simples</td><td></td><td>1500.0</td><td></td><td></td><td></td><td>IMP/GEREX</td><td>POR FUCIONAR ESTABELECIMENTO POTENCIALMENTE POLUIDOR'

In [265]:
texto_final[-1000:]

'<tr><td></td><td>ZZX3XEZJ</td><td></td><td>multa simples;</td><td>Fechada</td><td>5000.0</td><td></td><td></td><td></td><td></td><td>Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.</td><td>05/08/2022 17:46:40</td><td>Representante</td><td></td><td>4118709</td><td>Paulo Frontin</td><td>PR</td><td>02017.002161/2022-06</td><td>272491.0</td><td>Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.</td><td>Flora</td><td>Eliane Sfair dos Santos</td><td>01834887925</td><td></td><td>Atividade</td><td></td><td></td><td>-26,17136111111111</td><td>-50,73886111111111</td><td>Fazenda Chapéu de Sol</td><td></td><td></td><td>SUPES/PR</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>05/08/2022 17:51:56</td><td></td></tr>'

In [266]:
texto_completo = texto_final.split("<tr>")

In [267]:
len(texto_completo)

659542

In [268]:
texto_completo[0]

''

In [269]:
texto_completo[1]

'<td>3.0</td><td>26363</td><td>D</td><td>Multa simples</td><td></td><td>1500.0</td><td></td><td></td><td></td><td>IMP/GEREX</td><td>POR FUNCIONAR ESTABELICIMENTO PONTENCIALMENTE POLUIDORAS SEM O CADASTRO TECNICO FEDERAL SEM APRESENTAR RELATORIO ANUAL DE SUAS ATIVIDEDAS</td><td>05/03/2004 00:00:00</td><td></td><td>05/03/2004</td><td>2105302</td><td>IMPERATRIZ</td><td>MA</td><td>0205100001204</td><td>401001.0</td><td>Funcionar sem prévio registro no Ibama - Administradora</td><td>Penalidade pecuniária - Flora</td><td>PALADAR IOGURTE LTDA</td><td>01790868000103</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>-</td><td></td><td>IMP/GEREX</td><td>Rotina</td><td></td><td>/</td><td></td><td></td><td></td><td>01/06/2004 10:13:30</td><td>06/09/2010 10:09:03</td><td>Preenchido</td></tr>'

In [270]:
texto_completo[-1]

'<td></td><td>ZZX3XEZJ</td><td></td><td>multa simples;</td><td>Fechada</td><td>5000.0</td><td></td><td></td><td></td><td></td><td>Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.</td><td>05/08/2022 17:46:40</td><td>Representante</td><td></td><td>4118709</td><td>Paulo Frontin</td><td>PR</td><td>02017.002161/2022-06</td><td>272491.0</td><td>Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.</td><td>Flora</td><td>Eliane Sfair dos Santos</td><td>01834887925</td><td></td><td>Atividade</td><td></td><td></td><td>-26,17136111111111</td><td>-50,73886111111111</td><td>Fazenda Chapéu de Sol</td><td></td><td></td><td>SUPES/PR</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>05/08/2022 17:51:56</td><td></td></tr>'

In [271]:
texto_completo = texto_completo[1:]
tc = ["<tr>"+text for text in texto_completo]

In [272]:
tc[0]

'<tr><td>3.0</td><td>26363</td><td>D</td><td>Multa simples</td><td></td><td>1500.0</td><td></td><td></td><td></td><td>IMP/GEREX</td><td>POR FUNCIONAR ESTABELICIMENTO PONTENCIALMENTE POLUIDORAS SEM O CADASTRO TECNICO FEDERAL SEM APRESENTAR RELATORIO ANUAL DE SUAS ATIVIDEDAS</td><td>05/03/2004 00:00:00</td><td></td><td>05/03/2004</td><td>2105302</td><td>IMPERATRIZ</td><td>MA</td><td>0205100001204</td><td>401001.0</td><td>Funcionar sem prévio registro no Ibama - Administradora</td><td>Penalidade pecuniária - Flora</td><td>PALADAR IOGURTE LTDA</td><td>01790868000103</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>-</td><td></td><td>IMP/GEREX</td><td>Rotina</td><td></td><td>/</td><td></td><td></td><td></td><td>01/06/2004 10:13:30</td><td>06/09/2010 10:09:03</td><td>Preenchido</td></tr>'

In [273]:
len(tc)

659541

In [274]:
def gustavo(item):
	data = {}
	item_soup = BeautifulSoup(item,'lxml')
	tds = item_soup.find_all("td")
	dados = [i.text for i in tds]
	for i,j in zip(colunas,dados):
		data[i] = j
	return data

In [275]:
gustavo(tc[0])

{'SEQ AUTO INFRACAO': '3.0',
 'NUM_AUTO_INFRACAO': '26363',
 'SER_AUTO_INFRACAO': 'D',
 'TIPO_AUTO': 'Multa simples',
 'TIPO_MULTA': '',
 'VAL_AUTO_INFRACAO': '1500.0',
 'PATRIMONIO_APURACAO': '',
 'PATRIMONIO_PORTE': '',
 'GRAVIDADE_INFRACAO': '',
 'UNID_ARRECADACAO': 'IMP/GEREX',
 'DES_AUTO_INFRACAO': 'POR FUNCIONAR ESTABELICIMENTO PONTENCIALMENTE POLUIDORAS SEM O CADASTRO TECNICO FEDERAL SEM APRESENTAR RELATORIO ANUAL DE SUAS ATIVIDEDAS',
 'DAT_HORA_AUTO_INFRACAO': '05/03/2004 00:00:00',
 'FORMA_ENTREGA': '',
 'DAT_CIENCIA_AUTUACAO': '05/03/2004',
 'COD_MUNICIPIO': '2105302',
 'MUNICIPIO': 'IMPERATRIZ',
 'UF': 'MA',
 'NUM_PROCESSO': '0205100001204',
 'COD_INFRACAO': '401001.0',
 'DES_INFRACAO': 'Funcionar sem prévio registro no Ibama - Administradora',
 'TIPO_INFRACAO': 'Penalidade pecuniária - Flora',
 'NOME_INFRATOR': 'PALADAR IOGURTE LTDA',
 'CPF_CNPJ_INFRATOR': '01790868000103',
 'QTD_AREA': '',
 'INFRACAO_AREA': '',
 'DES_OUTROS_TIPO_AREA': '',
 'CLASSIFICACAO_AREA': '',
 'NUM_LATITUDE_AUTO': '',
 'NUM_LONGITUDE_AUTO': '',
 'DES_LOCAL_INFRACAO': '',
 'NOTIFICACAO_VINCULADA': '-',
 'ACAO_FISCALIZATORIA': '',
 'UNID_CONTROLE': 'IMP/GEREX',
 'TIPO_ACAO': 'Rotina',
 'OPERACAO': '',
 'DENUNCIA_SISLIV': '/',
 'ORDEM_FISCALIZACAO': '',
 'SOLICITACAO_RECURSO': '',
 'OPERACAO_SOL_RECURSO': '',
 'DAT_LANCAMENTO': '01/06/2004 10:13:30',
 'DAT_ULT_ALTERACAO': '06/09/2010 10:09:03',
 'TIPO_ULT_ALTERACAO': 'Preenchido'}

In [276]:
gustavo(tc[-1])

{'SEQ AUTO INFRACAO': '',
 'NUM_AUTO_INFRACAO': 'ZZX3XEZJ',
 'SER_AUTO_INFRACAO': '',
 'TIPO_AUTO': 'multa simples;',
 'TIPO_MULTA': 'Fechada',
 'VAL_AUTO_INFRACAO': '5000.0',
 'PATRIMONIO_APURACAO': '',
 'PATRIMONIO_PORTE': '',
 'GRAVIDADE_INFRACAO': '',
 'UNID_ARRECADACAO': '',
 'DES_AUTO_INFRACAO': 'Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.',
 'DAT_HORA_AUTO_INFRACAO': '05/08/2022 17:46:40',
 'FORMA_ENTREGA': 'Representante',
 'DAT_CIENCIA_AUTUACAO': '',
 'COD_MUNICIPIO': '4118709',
 'MUNICIPIO': 'Paulo Frontin',
 'UF': 'PR',
 'NUM_PROCESSO': '02017.002161/2022-06',
 'COD_INFRACAO': '272491.0',
 'DES_INFRACAO': 'Impedir a regeneração natural de floresta nativa, por meio de atividade de agricultura, em uma área de 01 ha (um hectare), sendo esta parte da área embargada sob o termo de n. 835/E.',
 'TIPO_INFRACAO': 'Flora',
 'NOME_INFRATOR': 'Eliane Sfair dos Santos',
 'CPF_CNPJ_INFRATOR': '01834887925',
 'QTD_AREA': '',
 'INFRACAO_AREA': 'Atividade',
 'DES_OUTROS_TIPO_AREA': '',
 'CLASSIFICACAO_AREA': '',
 'NUM_LATITUDE_AUTO': '-26,17136111111111',
 'NUM_LONGITUDE_AUTO': '-50,73886111111111',
 'DES_LOCAL_INFRACAO': 'Fazenda Chapéu de Sol',
 'NOTIFICACAO_VINCULADA': '',
 'ACAO_FISCALIZATORIA': '',
 'UNID_CONTROLE': 'SUPES/PR',
 'TIPO_ACAO': '',
 'OPERACAO': '',
 'DENUNCIA_SISLIV': '',
 'ORDEM_FISCALIZACAO': '',
 'SOLICITACAO_RECURSO': '',
 'OPERACAO_SOL_RECURSO': '',
 'DAT_LANCAMENTO': '',
 'DAT_ULT_ALTERACAO': '05/08/2022 17:51:56',
 'TIPO_ULT_ALTERACAO': ''}

In [277]:
%time
dados_final = Parallel(n_jobs=num_cores)(delayed(gustavo)(i) for i in tc)

CPU times: user 4 µs, sys: 2 µs, total: 6 µs
Wall time: 10 µs

In [278]:
len(dados_final)

659541

In [279]:
dados_final[0]

{'SEQ AUTO INFRACAO': '3.0',
 'NUM_AUTO_INFRACAO': '26363',
 'SER_AUTO_INFRACAO': 'D',
 'TIPO_AUTO': 'Multa simples',
 'TIPO_MULTA': '',
 'VAL_AUTO_INFRACAO': '1500.0',
 'PATRIMONIO_APURACAO': '',
 'PATRIMONIO_PORTE': '',
 'GRAVIDADE_INFRACAO': '',
 'UNID_ARRECADACAO': 'IMP/GEREX',
 'DES_AUTO_INFRACAO': 'POR FUNCIONAR ESTABELICIMENTO PONTENCIALMENTE POLUIDORAS SEM O CADASTRO TECNICO FEDERAL SEM APRESENTAR RELATORIO ANUAL DE SUAS ATIVIDEDAS',
 'DAT_HORA_AUTO_INFRACAO': '05/03/2004 00:00:00',
 'FORMA_ENTREGA': '',
 'DAT_CIENCIA_AUTUACAO': '05/03/2004',
 'COD_MUNICIPIO': '2105302',
 'MUNICIPIO': 'IMPERATRIZ',
 'UF': 'MA',
 'NUM_PROCESSO': '0205100001204',
 'COD_INFRACAO': '401001.0',
 'DES_INFRACAO': 'Funcionar sem prévio registro no Ibama - Administradora',
 'TIPO_INFRACAO': 'Penalidade pecuniária - Flora',
 'NOME_INFRATOR': 'PALADAR IOGURTE LTDA',
 'CPF_CNPJ_INFRATOR': '01790868000103',
 'QTD_AREA': '',
 'INFRACAO_AREA': '',
 'DES_OUTROS_TIPO_AREA': '',
 'CLASSIFICACAO_AREA': '',
 'NUM_LATITUDE_AUTO': '',
 'NUM_LONGITUDE_AUTO': '',
 'DES_LOCAL_INFRACAO': '',
 'NOTIFICACAO_VINCULADA': '-',
 'ACAO_FISCALIZATORIA': '',
 'UNID_CONTROLE': 'IMP/GEREX',
 'TIPO_ACAO': 'Rotina',
 'OPERACAO': '',
 'DENUNCIA_SISLIV': '/',
 'ORDEM_FISCALIZACAO': '',
 'SOLICITACAO_RECURSO': '',
 'OPERACAO_SOL_RECURSO': '',
 'DAT_LANCAMENTO': '01/06/2004 10:13:30',
 'DAT_ULT_ALTERACAO': '06/09/2010 10:09:03',
 'TIPO_ULT_ALTERACAO': 'Preenchido'}

In [280]:
df = pd.DataFrame(dados_final)

In [281]:
df

,SEQ AUTO INFRACAO,NUM_AUTO_INFRACAO,SER_AUTO_INFRACAO,TIPO_AUTO,TIPO_MULTA,VAL_AUTO_INFRACAO,PATRIMONIO_APURACAO,PATRIMONIO_PORTE,GRAVIDADE_INFRACAO,UNID_ARRECADACAO,...,UNID_CONTROLE,TIPO_ACAO,OPERACAO,DENUNCIA_SISLIV,ORDEM_FISCALIZACAO,SOLICITACAO_RECURSO,OPERACAO_SOL_RECURSO,DAT_LANCAMENTO,DAT_ULT_ALTERACAO,TIPO_ULT_ALTERACAO
0,3.0,26363,D,Multa simples,,1500.0,,,,IMP/GEREX,...,IMP/GEREX,Rotina,,/,,,,01/06/2004 10:13:30,06/09/2010 10:09:03,Preenchido
1,4.0,26364,D,Multa simples,,1500.0,,,,IMP/GEREX,...,IMP/GEREX,,,/,,,,01/06/2004 10:01:11,01/06/2004 10:01:11,Preenchido
2,5.0,26365,D,Multa simples,,2500.0,,,,IMP/GEREX,...,IMP/GEREX,,,/,,,,12/07/2004 11:58:19,12/07/2004 11:58:19,Preenchido
3,7.0,26367,D,Multa simples,,200.0,,,,IMP/GEREX,...,IMP/GEREX,,,/,,,,07/10/2005 17:14:21,23/04/2009 15:53:12,Preenchido
4,9.0,26369,D,Multa simples,,600.0,,,,IMP/GEREX,...,IMP/GEREX,,,/,,,,25/05/2005 10:08:53,25/05/2005 10:08:53,Preenchido
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
659536,,ZZKWIRGS,,multa simples;,Fechada,2707500.0,,,,,...,DITEC/PA,,,,,,,,02/08/2022 10:37:18,
659537,,ZZM64AB4,,multa simples;,Aberta,325000.0,,,Mdio,,...,DITEC/MA,,,,,,,,03/03/2023 14:25:37,
659538,,ZZM64AB4,,multa simples;,Aberta,325000.0,,,Mdio,,...,DITEC/MA,,,,,,,,03/03/2023 14:25:37,
659539,,ZZORTR3Q,,multa simples;,Aberta,4200.0,,,Mdio,,...,ICMBio,,,,,,,,14/10/2021 17:41:33,
659540,,ZZX3XEZJ,,multa simples;,Fechada,5000.0,,,,,...,SUPES/PR,,,,,,,,05/08/2022 17:51:56,

In [282]:
df['VAL_AUTO_INFRACAO'] = df['VAL_AUTO_INFRACAO'].apply(lambda x: x.replace(",","."))

In [283]:
df['VAL_AUTO_INFRACAO'] = pd.to_numeric(df['VAL_AUTO_INFRACAO'])

In [284]:
df['VAL_AUTO_INFRACAO']

0            1500.0
1            1500.0
2            2500.0
3             200.0
4             600.0
            ...
659536    2707500.0
659537     325000.0
659538     325000.0
659539       4200.0
659540       5000.0
Name: VAL_AUTO_INFRACAO, Length: 659541, dtype: float64

In [285]:
df['VAL_AUTO_INFRACAO'].max()

4306569666.0

In [286]:
df[df['VAL_AUTO_INFRACAO'] == df['VAL_AUTO_INFRACAO'].max()]

,SEQ AUTO INFRACAO,NUM_AUTO_INFRACAO,SER_AUTO_INFRACAO,TIPO_AUTO,TIPO_MULTA,VAL_AUTO_INFRACAO,PATRIMONIO_APURACAO,PATRIMONIO_PORTE,GRAVIDADE_INFRACAO,UNID_ARRECADACAO,...,UNID_CONTROLE,TIPO_ACAO,OPERACAO,DENUNCIA_SISLIV,ORDEM_FISCALIZACAO,SOLICITACAO_RECURSO,OPERACAO_SOL_RECURSO,DAT_LANCAMENTO,DAT_ULT_ALTERACAO,TIPO_ULT_ALTERACAO
235761,748345.0,285378,A,Multa simples,,4.306570e+09,,,,CONV/PM/MG,...,MG/SUPES,,,/,,,,02/02/2005 15:40:10,02/02/2005 15:40:10,Preenchido

In [288]:
df.iloc[235761]

SEQ AUTO INFRACAO                                                  748345.0
NUM_AUTO_INFRACAO                                                    285378
SER_AUTO_INFRACAO                                                         A
TIPO_AUTO                                                     Multa simples
TIPO_MULTA
VAL_AUTO_INFRACAO                                              4306569666.0
PATRIMONIO_APURACAO
PATRIMONIO_PORTE
GRAVIDADE_INFRACAO
UNID_ARRECADACAO                                                 CONV/PM/MG
DES_AUTO_INFRACAO         POR CONSUMIR QUANTIDADE SUPERIOR DE MDC AO PRE...
DAT_HORA_AUTO_INFRACAO                                  28/08/1992 00:00:00
FORMA_ENTREGA
DAT_CIENCIA_AUTUACAO
COD_MUNICIPIO                                                       3106200
MUNICIPIO                                                    BELO HORIZONTE
UF                                                                       MG
NUM_PROCESSO                                                  0201502314992
COD_INFRACAO                                                       619001.0
DES_INFRACAO              Causar danos ambientais, de qualquer natureza,...
TIPO_INFRACAO                    Penalidade pecuniária - Controle ambiental
NOME_INFRATOR                                     FERROESTE INDUSTRIAL LTDA
CPF_CNPJ_INFRATOR                                            20150090000104
QTD_AREA
INFRACAO_AREA
DES_OUTROS_TIPO_AREA
CLASSIFICACAO_AREA
NUM_LATITUDE_AUTO
NUM_LONGITUDE_AUTO
DES_LOCAL_INFRACAO
NOTIFICACAO_VINCULADA                                                     -
ACAO_FISCALIZATORIA
UNID_CONTROLE                                                      MG/SUPES
TIPO_ACAO
OPERACAO
DENUNCIA_SISLIV                                                           /
ORDEM_FISCALIZACAO
SOLICITACAO_RECURSO
OPERACAO_SOL_RECURSO
DAT_LANCAMENTO                                          02/02/2005 15:40:10
DAT_ULT_ALTERACAO                                       02/02/2005 15:40:10
TIPO_ULT_ALTERACAO                                               Preenchido
Name: 235761, dtype: object

In [289]:
df.iloc[235761]['DES_AUTO_INFRACAO']

'POR CONSUMIR QUANTIDADE SUPERIOR DE MDC AO PREVISTO NO PIFI.'

In [290]:
df[df['VAL_AUTO_INFRACAO'] >= 30000000]

,SEQ AUTO INFRACAO,NUM_AUTO_INFRACAO,SER_AUTO_INFRACAO,TIPO_AUTO,TIPO_MULTA,VAL_AUTO_INFRACAO,PATRIMONIO_APURACAO,PATRIMONIO_PORTE,GRAVIDADE_INFRACAO,UNID_ARRECADACAO,...,UNID_CONTROLE,TIPO_ACAO,OPERACAO,DENUNCIA_SISLIV,ORDEM_FISCALIZACAO,SOLICITACAO_RECURSO,OPERACAO_SOL_RECURSO,DAT_LANCAMENTO,DAT_ULT_ALTERACAO,TIPO_ULT_ALTERACAO
14698,18168.0,71081,B,Multa simples,,200000000.0,,,,CONV/PM/MG,...,MG/SUPES,,,/,,,,07/12/1998 00:00:00,07/12/1998 00:00:00,Preenchido
24303,28280.0,526862,D,Multa simples,,147621215.0,,,,DF/SUPES,...,DF/SUPES,,,/,,,,31/10/2005 14:36:44,27/03/2006 14:39:51,Preenchido
24304,28285.0,526867,D,Multa simples,,38755143.0,,,,DF/SUPES,...,DF/SUPES,,,/,,,,31/10/2005 14:36:44,27/03/2006 15:59:33,Preenchido
34987,61634.0,509919,D,Multa simples,,50000000.0,,,,RJ/SUPES,...,RJ/SUPES,,,/,,,,02/09/2005 12:15:36,02/05/2007 10:22:19,Preenchido
54226,424698.0,111655,A,Multa simples,,149182200.0,,,,DES3453,...,,,,/,,,,11/07/2000 16:22:34,11/07/2000 16:22:34,Preenchido
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
653919,,OPY26H1C,,multa simples;,Fechada,50000000.0,,,,,...,NUBIO/SC,,,,,,,,05/04/2022 12:20:27,
654487,,PV9M7H24,,multa simples;,Aberta,35055000.0,,,Mdio,,...,UNID_TEC_OIAPOQUE,,,,,,,,09/12/2019 13:06:44,
654694,,QATIH3TI,,multa simples;,Fechada,31338300.0,,,,,...,COFIS,,,,,,,,29/11/2021 08:51:57,
654857,,QM5CV1O9,,multa simples;,Aberta,35055000.0,,,Mdio,,...,UNID_TEC_OIAPOQUE,,,,,,,,03/12/2019 17:41:29,
658414,,XTV64M5P,,multa simples;,Fechada,43640000.0,,,,,...,ICMBio,,,,,,,,21/12/2020 13:33:39,

In [175]:
df.to_pickle("ibama_infracao_OUT_2022.pkl")

In [286]:
df.iloc[10]

SEQ AUTO INFRACAO                                                      19,0
NUM_AUTO_INFRACAO                                                     26379
SER_AUTO_INFRACAO                                                         D
TIPO_AUTO                                                     Multa simples
TIPO_MULTA
VAL_AUTO_INFRACAO                                                     300.0
PATRIMONIO_APURACAO
PATRIMONIO_PORTE
GRAVIDADE_INFRACAO
UNID_ARRECADACAO                                                  IMP/GEREX
DES_AUTO_INFRACAO         POR COMERCIALIZAR PRODUTO  FLORESTAIS  A SABER...
DAT_HORA_AUTO_INFRACAO                                  13/04/2005 10:20:00
FORMA_ENTREGA
DAT_CIENCIA_AUTUACAO
COD_MUNICIPIO                                                       2104057
MUNICIPIO                                                          ESTREITO
UF                                                                       MA
NUM_PROCESSO                                                  0205100029105
COD_INFRACAO                                                       422001,0
DES_INFRACAO              Receber e comercializar produto florestal sem ...
TIPO_INFRACAO                                 Penalidade pecuniária - Flora
NOME_INFRATOR                             MARIA SANTANA CAVALCANTE FERREIRA
CPF_CNPJ_INFRATOR                                               ***585323**
QTD_AREA
INFRACAO_AREA
DES_OUTROS_TIPO_AREA
CLASSIFICACAO_AREA
NUM_LATITUDE_AUTO
NUM_LONGITUDE_AUTO
DES_LOCAL_INFRACAO
NOTIFICACAO_VINCULADA                                                     -
ACAO_FISCALIZATORIA
UNID_CONTROLE                                                     IMP/GEREX
TIPO_ACAO
OPERACAO
DENUNCIA_SISLIV                                                           /
ORDEM_FISCALIZACAO
SOLICITACAO_RECURSO
OPERACAO_SOL_RECURSO
DAT_LANCAMENTO                                          02/06/2005 13:44:42
DAT_ULT_ALTERACAO                                       20/07/2006 12:54:59
TIPO_ULT_ALTERACAO                                               Preenchido
Name: 10, dtype: object

In [287]:
df.iloc[10]['DES_AUTO_INFRACAO']

'POR COMERCIALIZAR PRODUTO  FLORESTAIS  A SABER: 2,816 M3 DE MADEIRA EM TOROS DA ESSÊNCIA FLORESTAL JATOBÁ, SEM ADEVIDA COBERTURA DE ATPF.'

In [288]:
df.iloc[10000]

SEQ AUTO INFRACAO                                                   12459,0
NUM_AUTO_INFRACAO                                                     26551
SER_AUTO_INFRACAO                                                         D
TIPO_AUTO                                                     Multa simples
TIPO_MULTA
VAL_AUTO_INFRACAO                                                    4300.0
PATRIMONIO_APURACAO
PATRIMONIO_PORTE
GRAVIDADE_INFRACAO
UNID_ARRECADACAO                                                   MA/SUPES
DES_AUTO_INFRACAO         TRANSPORTAR 42 M3 DE CARVÃO VEGETAL SEM CARIMB...
DAT_HORA_AUTO_INFRACAO                                  03/11/2000 00:00:00
FORMA_ENTREGA
DAT_CIENCIA_AUTUACAO                                             03/11/2000
COD_MUNICIPIO                                                       2104800
MUNICIPIO                                                            GRAJAU
UF                                                                       MA
NUM_PROCESSO                                                  0201200390500
COD_INFRACAO                                                       403003,0
DES_INFRACAO              Transportar produto florestal com ATPF rasurad...
TIPO_INFRACAO                                 Penalidade pecuniária - Flora
NOME_INFRATOR                           GUARANY SIDERÚRGICA E MINERAÇÃO S/A
CPF_CNPJ_INFRATOR                                            10426518000145
QTD_AREA
INFRACAO_AREA
DES_OUTROS_TIPO_AREA
CLASSIFICACAO_AREA
NUM_LATITUDE_AUTO
NUM_LONGITUDE_AUTO
DES_LOCAL_INFRACAO
NOTIFICACAO_VINCULADA                                                     -
ACAO_FISCALIZATORIA
UNID_CONTROLE                                                      MA/SUPES
TIPO_ACAO
OPERACAO
DENUNCIA_SISLIV                                                           /
ORDEM_FISCALIZACAO
SOLICITACAO_RECURSO
OPERACAO_SOL_RECURSO
DAT_LANCAMENTO                                          27/11/2000 17:53:16
DAT_ULT_ALTERACAO                                       27/11/2000 17:53:16
TIPO_ULT_ALTERACAO                                               Preenchido
Name: 10000, dtype: object

In [289]:
df.iloc[10000]['DES_AUTO_INFRACAO']

'TRANSPORTAR 42 M3 DE CARVÃO VEGETAL SEM CARIMBO VALIDO EM BRANCO  CAMPO 19 ATPF  Nº0547259 CAMINHÃO MERCEDES BENZ BRANCA PLACA HPF 3238 -MA LAT.05.39.05 S LONG. 49.29.3 S'